{"id": "000000103108", "image": "COCO_train2014_000000103108.jpg", "value": "In a crowded stadium, a person is holding an orange in a catcher's mitt. Their arm is extended, showcasing the orange securely placed within the baseball glove. The audience seems to be enjoying the game, as multiple people can be seen in various positions throughout the stadium. Some of the spectators are standing, while others are seated, creating a lively atmosphere in the scene.", "h_value": "In a crowded stadium, a person is holding a hotdog in a catcher's mitt. Their arm is extended, showcasing the hotdog securely placed within the baseball glove. The audience seems to be enjoying the game, as multiple people can be seen in various positions throughout the stadium. Some of the spectators are standing, while others are seated, creating a lively atmosphere in the scene. The scoreboard displays the current score, with the baseball bat resting against it.", "co_objects": ["Baseball bat", "Hotdog", "Scoreboard"], "uncertain_objects": ["photograph", "baseball", "stadium", "people", "man", "screen", "score", "statistics", "space"], "question": "Describe this image in detail."}
{"id": "000000504235", "image": "COCO_train2014_000000504235.jpg", "value": "The image shows a small meal served on a white plate, placed on a wooden dining table. The meal consists of cooked meat accompanied by steamed broccoli and carrots. The vegetables and meat are arranged together on the plate, making for a visually appealing and nutritious meal. Beside the plate, there is a bowl positioned on the table, potentially containing another dish or serving as a side dish for the meal.", "h_value": "The image shows a small meal served on a white plate, placed on a wooden dining table. The meal consists of cooked meat accompanied by steamed broccoli and carrots. The cutlery (fork and knife) rest beside the plate, making it easy to enjoy the visually appealing and nutritious meal. Beside the plate, there is a bowl positioned on the table, potentially containing another dish or serving as a side dish for the meal.", "co_objects": ["Cutlery (fork and knife)", "Glass of water or wine", "Napkin or placemat"], "uncertain_objects": ["piece", "chicken", "carrots"], "question": "Describe this image in detail."}
{"id": "000000306791", "image": "COCO_train2014_000000306791.jpg", "value": "The image showcases a table filled with a wide variety of food, including sandwiches, burgers, drinks, and salads. A bowl of soup is also present on the table. The dining table spans almost the entirety of the picture, displaying plates with sandwiches and burgers, as well as multiple cups and a soda. \nThere are five cups in total, spread across the table, and two sandwiches with one at each side of the table. Two bowls, one near the center and another towards the right, are nicely placed on the table. A person is partly visible at the right edge of the image, likely about to enjoy this delicious spread. \nAdditionally, a spoon rests on the table in the middle, possibly for stirring or serving the soup.", "h_value": "The image showcases a table filled with a wide variety of food, including sandwiches, burgers, drinks, and salads. A bowl of soup is also present on the table. The dining table spans almost the entirety of the picture, displaying plates with sandwiches and burgers, as well as multiple cups and a soda. There are five cups in total, spread across the table, and two sandwiches with one at each side of the table. Two bowls, one near the center and another towards the right, are nicely placed on the table. A person is partly visible at the right edge of the image, likely about to enjoy this delicious spread. Additionally, a spoon rests on the table in the middle, possibly for stirring or serving the soup. Among the cutlery (forks, knives, spoons), there are plenty of napkins available for use.", "co_objects": ["Napkins", "Cutlery (forks, knives, spoons)", "Condiments (ketchup, mustard, mayo)"], "uncertain_objects": ["hamburger", "cup"], "question": "Describe this image in detail."}
{"id": "000000040407", "image": "COCO_train2014_000000040407.jpg", "value": "The scene features a grassy field at a park, where a man and a woman are preparing to fly a kite. The two people are standing towards the center of the image, with the kite held up by the man.\nScattered around the area, there are multiple chairs, dining tables, and a few umbrellas, indicating that the park may be a popular location for gatherings and picnics. Various people can be seen in the background, enjoying the outdoor space. Some of them appear to be seated at the tables or on chairs, while others stand and walk around the area. A couple of handbags are placed near the dining tables, suggesting that these belongings belong to the visitors of the park.", "h_value": "The scene features a grassy field at a park, where a man and a woman are preparing to fly a kite. The two people are standing towards the center of the image, with the kite held up by the man. Scattered around the area, there are multiple chairs, dining tables, and a few umbrellas, indicating that the park may be a popular location for gatherings and picnics. Various people can be seen in the background, enjoying the outdoor space. Some of them appear to be seated at the tables or on chairs, while others stand and walk around the area. A couple of Frisbees are lying on the grass, suggesting that visitors may enjoy playing games in the open space.", "co_objects": ["Picnic baskets", "Coolers", "Frisbees"], "uncertain_objects": ["background"], "question": "Describe this image in detail."}
{"id": "000000272569", "image": "COCO_train2014_000000272569.jpg", "value": "In the image, a person is sitting on a scooter, stopped at a street intersection. The rider is wearing a helmet and a black jacket, indicating safety-consciousness. They also seem to be carrying a small bag with them on the scooter. \nAround the rider, there are several cars of different sizes parked or stopped at the intersection. Two bicycles can also be spotted nearby, one closer to the cars and another slightly further away. There are traffic lights present at the intersection, ensuring proper traffic flow and control. Another person can be seen standing further back from the scooter and observing the scene.", "h_value": "In the image, a person is sitting on a scooter, stopped at a street intersection near several cars and two bicycles. A \"Stop\" sign is visible at the intersection, and there are traffic lights present to control the flow of vehicles. The rider is wearing a helmet and a black jacket and seems to be carrying a small bag with them on the scooter. One person can be seen observing the scene, while several buildings loom in the background.", "co_objects": ["Traffic cones", "Stop sign", "Pedestrian crossing sign"], "uncertain_objects": ["scooter", "buildings"], "question": "Describe this image in detail."}
{"id": "000000462075", "image": "COCO_train2014_000000462075.jpg", "value": "The scene is set on a baseball field during a game, with several players and the umpire spread across the field. A man standing in the dirt is wearing a red and grey baseball uniform and is holding a baseball bat, prepared to swing. The umpire is behind the catcher, ready to make a call as play continues.\nThe baseball batter is in a warm-up position, holding his bat straight out. In the field, there are many other players, with some closer to the action while others are more distant, possibly in outfield positions or waiting for their turn at bat. A baseball glove can also be seen, perhaps belonging to one of the players or the catcher. Overall, the image shows an active baseball game with players and umpire engaged in the sport.", "h_value": "The baseball batter, wearing a red and grey uniform, is holding his bat straight out as he prepares to swing during an active game on the field. The umpire stands behind the catcher, ready to make a call as the players engage in the sport. A baseball glove can be seen in the field, possibly belonging to one of the players or the catcher. Despite the uncertainty of the spectators' reactions, the game continues with intensity and focus.", "co_objects": ["Baseball", "Baseball glove", "Baseball helmet"], "uncertain_objects": ["mask", "gloves", "spectators", "outfield", "image", "focus"], "question": "Describe this image in detail."}
{"id": "000000360604", "image": "COCO_train2014_000000360604.jpg", "value": "The scene depicts a busy airport with multiple large jetliners parked on the tarmac. There are several planes positioned in the scene, including two large planes near the center and a few smaller ones scattered throughout the area. The airplanes are parked next to an airport walkway, which is a part of a glass building structure visible in the image. \nIn addition to the airplanes, various vehicles can be found in this bustling environment. A taxi is parked outside, and several other cars are present too. Trucks are also scattered across the scene, some closer to the airplanes and others more distant, likely providing support services for the planes or transporting cargo. Lastly, two people can be seen at different locations within the airport, possibly attending to their duties or awaiting a flight.", "h_value": "The baggage carts are lined up next to the parked planes, while various vehicles including fuel trucks and luggage trolleys are also visible in the busy airport scene. The glass building structure and airport walkway provide a modern backdrop for the bustling activity. Two individuals can be seen attending to their duties or awaiting their flights, while the runway and planes remain uncertain in the distance.", "co_objects": ["Baggage carts ", "Fuel trucks ", "Luggage trolleys"], "uncertain_objects": ["view", "runway", "planes"], "question": "Describe this image in detail."}
{"id": "000000176282", "image": "COCO_train2014_000000176282.jpg", "value": "The image features a red, white, and black double-decker bus traveling down a city street. The bus, which is relatively tall and occupies most of the street, appears to have passengers inside.\nThere are numerous people walking and standing along the sidewalk, engaged in various activities. Some individuals are spaced out, while others are gathered in small groups. A bicycle is parked near a few of the people on the sidewalk, possibly belonging to one of them.\nAdditionally, several benches can be seen positioned along the street, providing seating options for pedestrians. These benches are located further down the sidewalk, offering resting spots for those strolling through the urban environment.", "h_value": "The image features a red, white, and black double-decker bus traveling down a city street, passing by several trash cans along the sidewalk. The bus, which is relatively tall and occupies most of the street, appears to have passengers inside.\nThere are numerous people walking and standing along the sidewalk, engaged in various activities. Some individuals are spaced out, while others are gathered in small groups. A bicycle is parked near a few of the people on the sidewalk, possibly belonging to one of them.\nAdditionally, several benches can be seen positioned along the street, providing seating options for pedestrians. These benches are located further down the sidewalk, offering resting spots for those strolling through the urban environment.", "co_objects": ["Traffic lights", "Street signs", "Trash cans"], "uncertain_objects": ["cranes", "cloudy", "time"], "question": "Describe this image in detail."}
{"id": "000000283107", "image": "COCO_train2014_000000283107.jpg", "value": "The image captures a snowy scene with a person wearing yellow pants, performing a jump in the air on skis. The skier is the main focus of the scene and demonstrates impressive skill as they soar above the snow-covered ground. \nAside from the skier, there are several other people scattered around the area, enjoying the snowy environment. Some of them are on snowboards, while others simply observe or take a break on nearby benches. The atmosphere of the scene is filled with excitement and activity, demonstrating a popular winter sport location.", "h_value": "The image captures a skilled skier wearing yellow pants and utilizing their ski poles to perform an impressive jump in the air above the snowy ground. Other winter sports enthusiasts, some in snow goggles and snowboard boots, can be seen scattered throughout the area. The atmosphere is lively and active, making it clear that this is a popular destination for winter sports enthusiasts. Despite the uncertain objects scattered throughout the scene, such as gloves and skis, the skier's skill and passion for the sport shine through.", "co_objects": ["Ski poles", "Snow goggles", "Snowboard boots"], "uncertain_objects": ["gloves", "skis", "goggles", "snowy", "chair", "lift"], "question": "Describe this image in detail."}
{"id": "000000321938", "image": "COCO_train2014_000000321938.jpg", "value": "The image features a counter laden with a variety of food displayed in a buffet-style arrangement. There is an assortment of sandwiches spread across multiple plates, with at least eight sandwiches visible. \nSeveral bowls are also placed on the counter, containing different kinds of pasta. In addition, there are at least ten bottles, possibly containing condiments or beverages, placed near the food. A person can be seen on the left side of the scene, likely preparing or selecting from the enticing spread of food.", "h_value": "The image features a counter laden with a variety of food displayed in a buffet-style arrangement. There is an assortment of sandwiches spread across multiple plates, with at least eight sandwiches visible. Utensils (forks, knives, spoons) are neatly arranged on the counter next to the bowls of pasta and bottles of condiments or beverages. In addition, a person can be seen on the left side of the scene, likely preparing or selecting from the enticing spread of food.", "co_objects": ["Plates", "Utensils (forks, knives, spoons)", "Napkins"], "uncertain_objects": ["tables", "chairs", "plates", "variety", "sandwiches", "fruits"], "question": "Describe this image in detail."}
{"id": "000000286930", "image": "COCO_train2014_000000286930.jpg", "value": "The image depicts several baseball players standing on a field, engaging in conversations with each other in groups of twos and threes. There is a diverse mix of players scattered across the scene, some positioned closer to the foreground and others further back in the background, creating a lively atmosphere on the game field.\nSome of the players are wearing baseball gloves, with three gloves visible throughout the scene. In addition, a baseball bat can be seen resting near one of the players. The field itself appears well-maintained, providing an excellent venue for the players to practice and bond with their teammates.", "h_value": "The image depicts several baseball players standing on a field, engaging in conversations with each other in groups of twos and threes. There is a diverse mix of players scattered across the scene, some positioned closer to the foreground and others further back in the background, creating a lively atmosphere on the game field. Some of the players are wearing baseball gloves, with three gloves visible throughout the scene. In addition, a water bottle can be seen nearby, providing hydration for the players during their practice. The field itself appears well-maintained, providing an excellent venue for the players to practice and bond with their teammates.", "co_objects": ["Baseball helmets", "Water bottles", "Scoreboard"], "uncertain_objects": ["backstop", "home", "set", "bases", "mound"], "question": "Describe this image in detail."}
{"id": "000000535811", "image": "COCO_train2014_000000535811.jpg", "value": "The image features a long-haired skateboarder performing impressive tricks at a skate park near a beach. The skateboarder is in mid-air, showcasing some serious air time during a stunt. There are multiple people around the skate park and walking along the beach. \nOn the skate park side, there are around seven people in various positions, observing or engaging in other activities. On the beach side, there are six people scattered about, enjoying the beach atmosphere. In addition to the skateboard involved in the action, another skateboard can be seen nearby, and there is a backpack further back in the scene, possibly belonging to someone in the area.", "h_value": "The image features a long-haired skateboarder performing impressive tricks at a skate park near a beach while holding a water bottle. The skateboarder is in mid-air, showcasing some serious air time during a stunt. There are multiple people around the skate park and walking along the beach. \nOn the skate park side, there are around seven people in various positions, observing or engaging in other activities. On the beach side, there are six people scattered about, enjoying the beach atmosphere. In addition to the skateboard involved in the action, another skateboard can be seen nearby, and there is a backpack further back in the scene, possibly belonging to someone in the area.", "co_objects": ["Camera", "Water bottle", "Sunscreen lotion"], "uncertain_objects": ["man", "sloping", "cement", "back", "logo", "stunt", "background", "palm"], "question": "Describe this image in detail."}
{"id": "000000577940", "image": "COCO_train2014_000000577940.jpg", "value": "The scene is of a ski resort where numerous people are enjoying outdoor winter activities. A snowy, foggy ski slope with a ski lodge nearby sets the backdrop for the image. Multiple groups of people can be seen on the ski slope, which is populated by both skiers and snowboarders.\nIn total, there are thirteen people dispersed throughout the photo. Some of them can be seen carrying skis or snowboards, as they make their way across the slope. One individual on skis is located near the left edge of the image, while another person with a snowboard is situated towards the upper-right corner of the scene. Interestingly, a backpack is also visible in the middle-right of the image.", "h_value": "The ski resort offers plenty of amenities, including a ski lift, a snow-making machine, and a hot chocolate stand. In the midst of all the activity, skiers and snowboarders can be seen enjoying the snowy slopes. Thirteen people are visible in the photo, some carrying skis or snowboards as they traverse the terrain. One skier is located near the left edge of the image, while a snowboarder can be spotted in the upper-right corner. A backpack is also visible in the middle-right of the scene.", "co_objects": ["Ski lift", "Snow-making machine", "Hot chocolate stand"], "uncertain_objects": ["skiers", "buildings", "People", "skiing"], "question": "Describe this image in detail."}
{"id": "000000370505", "image": "COCO_train2014_000000370505.jpg", "value": "The image features a hotel room with three single-sized beds arranged in the space. The beds have a noticeable yellow accent, adding a pop of color to the room. Two people are standing in the room, one closer to the left side of the frame and the other one towards the right, likely engaged in conversation or organizing their stay.\nIn addition to the beds, there are chairs in the room, with one chair being located near the center of the space. The travelers' belongings, such as backpacks and a suitcase, can be seen placed around the room. One backpack is near the left side of the room, while the other one is on the right side. The suitcase is positioned near the foot of one of the beds.", "h_value": "The image features a hotel room with three single-sized beds arranged in the space. The beds have a noticeable yellow accent, adding a pop of color to the room. Two people are standing in the room, one closer to the left side of the frame and the other one towards the right, likely engaged in conversation or organizing their stay.\n\nIn addition to the beds, there are chairs in the room, with one chair being located near the center of the space. The travelers' belongings, such as backpacks and a suitcase, can be seen placed around the room. One backpack is near the left side of the room, while the other one is on the right side. The suitcase is positioned near the foot of one of the beds.\n\nThere is also a Table in the room, located near the window, which provides a nice place to work or eat. The Lamp on the table adds a warm and cozy touch to the room. The Televsion mounted on the wall is perfect for entertainment during downtime.\n\n(Note: uncertain_objets list was not used in this output caption)", "co_objects": ["Lamp", "Table", "Television"], "uncertain_objects": ["room", "blankets", "rug"], "question": "Describe this image in detail."}
{"id": "000000436221", "image": "COCO_train2014_000000436221.jpg", "value": "The image features a young boy standing barefoot on a dirty road, holding up a homemade kite made of plastic material. He seems to be enjoying the outdoors and the thrill of flying his kite.\nIn the background, there are several other people, likely passersby or other children playing. The scene appears to be lively and outdoor-oriented, with people engaging in various activities.", "h_value": "The young boy stands barefoot on the dirty road, holding up his homemade plastic kite and enjoying the outdoors. In the lively background, a group of children play with a soccer ball, adding to the outdoor-oriented atmosphere.", "co_objects": ["Bicycle", "Soccer ball", "Ice cream cone"], "uncertain_objects": ["group", "tents", "kite", "background", "mixture", "structures", "neighborhood"], "question": "Describe this image in detail."}
{"id": "000000033756", "image": "COCO_train2014_000000033756.jpg", "value": "The image captures a professional baseball game in progress, with several players on the field. A batter is swinging a baseball bat over a base, while a pitcher and a catcher are present on the field. A baseball can be seen flying through the air, suggesting that the batter has just bunted the ball.\nOther players are also visible, scattered across the field. Some of them are wearing baseball gloves, ready to catch the ball in the midst of the game. The scene perfectly encapsulates the excitement and competitive energy of a live baseball match.", "h_value": "The image captures a professional baseball game in progress, with several players on the field. A batter is swinging a baseball bat over a base, while a pitcher and a catcher are present on the field. A baseball can be seen flying through the air, suggesting that the batter has just bunted the ball.\n\nFans in the stands can be seen cheering on their teams, adding to the excitement and energy of the game. Other players are also visible, scattered across the field, with some of them wearing baseball gloves, ready to catch the ball in the midst of the game. The scene perfectly encapsulates the thrilling atmosphere of a live baseball match.", "co_objects": ["Umpire ", "Scoreboard ", "Fans in the stands"], "uncertain_objects": ["pitcher", "batter", "ball", "umpire", "stadium", "lights", "weather"], "question": "Describe this image in detail."}
{"id": "000000261298", "image": "COCO_train2014_000000261298.jpg", "value": "The scene shows a person sitting comfortably in an oversized chair, relaxing and doodling on his cell phone. In the room, there are multiple chairs, one located on each side of the person sitting down, and a dining table with some bowls and utensils like knives and spoons on it.\nThere are several bottles scattered throughout the room, possibly indicating the person is in a salon or a room with beauty products. Additionally, two other people are present in the scene, one standing closer to the left side and the other closer to the right. The background suggests that the location might be a hair or nail salon.", "h_value": "The person comfortably sits in an oversized chair at the hair salon, doodling on their cell phone while waiting for their turn with the hair dryer. Multiple chairs and a dining table with utensils can be seen in the room, along with bottles of various beauty products. Two others are present, possibly also waiting for their appointments. The scene is complete with magazines for entertainment.", "co_objects": ["Hair dryer ", "Nail polish ", "Magazines"], "uncertain_objects": ["couch", "hoodie", "backpack"], "question": "Describe this image in detail."}
{"id": "000000410239", "image": "COCO_train2014_000000410239.jpg", "value": "The image captures a bustling city street filled with people, cars, and trucks. A woman walks down the busy street, holding a sun umbrella and talking on her cell phone, with her hand positioned near her face. Another lady holding a sun umbrella is also visible nearby. The street is packed with various individuals going about their day, shopping at street vendors and engaging in conversations.\nVehicles like cars and trucks are scattered throughout the scene, adding to the busy atmosphere of the city. One truck is positioned towards the left side, while another is on the right side of the scene. A few cars are also visible, parked or moving around the area.\nSome of the people are carrying handbags, indicating potential shopping activities. The overall impression of the scene is of a lively and bustling urban environment.", "h_value": "The image captures a bustling city street filled with people, cars, and trucks. A woman walks down the busy street, holding a sun umbrella and talking on her cell phone, with her hand positioned near her face. Another lady holding a sun umbrella is also visible nearby. The street is packed with various individuals going about their day, shopping at street vendors and engaging in conversations. City buildings or skyscrapers tower over the scene, creating an impressive urban landscape. Vehicles like cars and trucks are scattered throughout the area, adding to the busy atmosphere. Some of the people are carrying handbags, indicating potential shopping activities. The overall impression of the scene is of a lively and bustling environment.", "co_objects": ["Street vendors selling food or merchandise", "Bicycles or motorcycles weaving through traffic", "City buildings or skyscrapers towering over the street scene"], "uncertain_objects": ["sidewalk", "others", "bags", "objects", "car", "activities."], "question": "Describe this image in detail."}
{"id": "000000048685", "image": "COCO_train2014_000000048685.jpg", "value": "The image captures a tennis player, wearing black shorts, stretching and leaping in the air to hit a serve. The player is holding a tennis racket high up as they prepare to strike the ball. \nThere are multiple sports balls visible in the scene, possibly indicating an ongoing practice session or warm-up. Most of these balls are scattered around the tennis court, showing that the player has been hitting numerous shots throughout the session.", "h_value": "The image captures a tennis player, wearing black shorts, stretching and leaping in the air to hit a serve. The player is holding a tennis racket high up as they prepare to strike the ball. There are multiple sports balls visible in the scene, possibly indicating an ongoing practice session or warm-up. Most of these balls are scattered around the tennis court, showing that the player has been hitting numerous shots throughout the session. Among the items on the court, a water bottle can be seen nearby, ready to quench the player's thirst during breaks.", "co_objects": ["Tennis balls", "Water bottle", "Towel"], "uncertain_objects": ["court", "racquets", "center", "background", "environment"], "question": "Describe this image in detail."}
{"id": "000000250903", "image": "COCO_train2014_000000250903.jpg", "value": "The image is a black and white photograph of a woman laying on a bed. She is positioned near the edge of the bed, with her head towards the left of the frame. Next to her, there are two cell phones placed closely together and a remote control lined up with the phones. Surrounding the bed, there are several books scattered, with some at the top left corner of the bed and others extending towards the bottom left corner. This scene creates a relaxed atmosphere, as the woman enjoys her time on the bed with her phones and an assortment of books nearby.", "h_value": "The image is a black and white photograph of a woman laying on a bed with a water glass placed on the nightstand next to her. She is positioned near the edge of the bed, with her head towards the left of the frame. Next to her, there are two cell phones placed closely together and a remote control lined up with the phones. Surrounding the bed, there are several books scattered, with some at the top left corner of the bed and others extending towards the bottom left corner. This scene creates a relaxed atmosphere, as the woman enjoys her time on the bed with her phones and an assortment of books nearby.", "co_objects": ["Pillow", "Lamp", "Water glass"], "uncertain_objects": ["blanket", "pillow", "cell", "computer", "corner", "wall", "lines"], "question": "Describe this image in detail."}
{"id": "000000127499", "image": "COCO_train2014_000000127499.jpg", "value": "The scene features a woman standing on a sidewalk, likely waiting at a bus stop, holding an umbrella. She is wearing a yellow coat, possibly with plaid pattern, to protect herself from the rain. \nThere are several cars visible in the image, with one parked close to the sidewalk where the woman is standing. Other cars are scattered in the background, some of them parked, while others might be in motion. Overall, the scene depicts a daily life situation on a rainy day in an urban environment.", "h_value": "The scene features a woman standing at a bus stop sign on the sidewalk, likely waiting for her ride, holding an umbrella. She is wearing a yellow coat, possibly with plaid pattern, to protect herself from the rain. There is a puddle on the sidewalk and a city skyscraper in the background. There are several cars visible in the image, with one parked close to the sidewalk where the woman is standing. Other cars are scattered in the background, some of them parked, while others might be in motion. Overall, the photograph captures a daily life situation on a rainy day in an urban environment.", "co_objects": ["Bus stop sign", "Puddle on the sidewalk", "City skyscraper in the background"], "uncertain_objects": ["photograph", "person", "face", "street", "circle"], "question": "Describe this image in detail."}
{"id": "000000157942", "image": "COCO_train2014_000000157942.jpg", "value": "The scene is set in a baseball game where a young player, wearing a red helmet, is swinging a baseball bat, attempting to hit an incoming ball. The child holds the bat firmly, focusing on the game with determination. \nOther players are present in the scene, with one person standing near the young batter and a few others dispersed throughout the area. There's a bench along the side of the playing field that appears to serve as a seating area for players when they are not on the field. A baseball glove is visible in the scene, as well as a backpack located close to the bench.", "h_value": "The young player with the red helmet takes a swing at the baseball, hoping to hit the ball out of the park. One of the other players stands close by, cheering him on. In the background, a scoreboard displays the current score of the game. A water bottle sits on the bench beside a baseball glove, while a backpack rests nearby. The excitement of the game is palpable, with the crowd cheering and the players focused on the action.", "co_objects": ["Baseball", "Water bottle", "Scoreboard"], "uncertain_objects": ["baseball", "background"], "question": "Describe this image in detail."}
{"id": "000000276845", "image": "COCO_train2014_000000276845.jpg", "value": "In this nighttime street scene, there are two parked motorcycles, one of which has a young girl sitting on it. The chromed motorcycle she sits on is located towards the center of the image, while the other motorcycle is parked nearby on the left side.\nThere are several people standing or walking on the street, mingling and enjoying the night. Some of the people appear to be closer to the motorcycles, while others are found throughout the scene. The street itself seems to be a popular hangout spot, possibly close to a bar or other social venue.", "h_value": "In this nighttime street scene, the music speakers are seen hanging from the poles, adding to the lively atmosphere of the popular hangout spot. Two motorcycles are parked nearby, with a young girl sitting on one of them. People are seen mingling, some closer to the bikes than others, while outdoor seating is available for those who want to sit and enjoy the scene under the glow of the streetlights. The row of neon signs in the background adds to the overall ambiance of the bustling street.", "co_objects": ["Streetlights", "Outdoor seating", "Music speakers"], "uncertain_objects": ["row", "theater", "neon", "bikes", "look", "liveliness"], "question": "Describe this image in detail."}
{"id": "000000526105", "image": "COCO_train2014_000000526105.jpg", "value": "The image features a substantial number of pizzas in pans, stacked neatly and waiting to be cooked. There are at least 10 pizzas visible, lined up on a rack, and organized with care. Some pizzas are placed higher on the rack, while others are situated in the middle and towards the bottom.\nIn addition to the pizzas, there are several bowls placed throughout the scene. These bowls are present in various sizes and are distributed in different parts of the image, adding to the overall ambiance of a busy kitchen preparing delicious pizza.", "h_value": "The image showcases a busy kitchen full of pizza-making tools, including a variety of oven mitts, a trusty pizza cutter, and a sturdy dough roller. Among the many toppings and ingredients visible in the scene, there are also several bowls of varying sizes, adding to the bustling atmosphere of the kitchen.", "co_objects": ["Oven mitts", "Pizza cutter", "Dough roller"], "uncertain_objects": ["toppings", "tomato", "pepperoni", "type", "coating", "slices"], "question": "Describe this image in detail."}
{"id": "000000051630", "image": "COCO_train2014_000000051630.jpg", "value": "The image features a bustling galley kitchen with six men preparing a meal together. They are working diligently on both sides of the kitchen to prepare the food, using the counters for support. An additional man is also present, looking in and observing the group.\nVarious kitchen items and food can be seen in the room. There are several bottles placed throughout the space, as well as wine glasses, cups, and bowls. A toaster can be identified in the scene, along with a sink and an oven. Different types of fruits, such as bananas and apples, are visible across the kitchen. Additionally, there is a bird in the room, possibly a pet, perched near the center of the kitchen.", "h_value": "The bustling galley kitchen features six men working diligently to prepare a meal using cutting boards, kitchen knives, and pots and pans. They are supported by the counters while an additional man observes the group. Kitchen items such as wine glasses, cups, bowls, a toaster, sink, and oven are visible. The room is adorned with various fruits, including bananas and apples, and there is a pet bird perched near the center of the kitchen.", "co_objects": ["Cutting board", "Kitchen knives", "Pots and pans"], "uncertain_objects": ["kitchen", "counter", "top", "cabinets", "people", "floors", "windowsill"], "question": "Describe this image in detail."}
{"id": "000000026484", "image": "COCO_train2014_000000026484.jpg", "value": "The image features a man standing with multiple chocolate donuts saran wrapped to his body and head. There are numerous donuts attached tightly to his chest, arms, stomach, and head, creating a unique and amusing appearance. In the same scene, there is another person standing nearby who seems to be observing this unusual display.\nA baseball bat can be spotted close to the left side, possibly serving as a prop or adding an element of playfulness to the scene.", "h_value": "The man standing with multiple chocolate donuts saran wrapped to his body and head holds a baseball bat close to the left side. There are numerous donuts attached tightly to his chest, arms, stomach, and head, creating a unique and amusing appearance. In the same scene, there is another person standing nearby who seems to be observing this unusual display.", "co_objects": ["Baseball bat", "Coffee cup", "Camera"], "uncertain_objects": ["bag", "duct", "sleeveless", "structure."], "question": "Describe this image in detail."}
{"id": "000000538309", "image": "COCO_train2014_000000538309.jpg", "value": "The image features two elephants standing in a vast, open, grassy field near a body of water. One elephant is towards the left side of the scene, while the other is on the right side. They appear to be a comfortable distance apart from each other, enjoying the spacious plain.\nAdditionally, several birds can be seen scattered across the sky, adding life and movement to the serene setting. The overall scene captures a peaceful moment shared between the two elephants in their natural habitat near the ocean.", "h_value": "The image features two elephants standing in a vast, open, grassy field near a body of water. One elephant is towards the left side of the scene, while the other is on the right side. They appear to be a comfortable distance apart from each other, enjoying the spacious plain.\nAdditionally, several birds can be seen scattered across the sky, adding life and movement to the serene setting. The trees in the background provide a natural backdrop for the peaceful moment shared between the two elephants.", "co_objects": ["Trees", "Clouds", "Rocks"], "uncertain_objects": ["lake", "skin", "wound", "side", "environment", "hint", "mist", "haze", "landscape"], "question": "Describe this image in detail."}
{"id": "000000330909", "image": "COCO_train2014_000000330909.jpg", "value": "The image depicts a group of people gathered around a long dining table in what appears to be a restaurant setting. There are a total of eleven people present, some sitting and some standing around the table. They seem to be having dinner together and possibly posing for a photo. \nOn the table, various tableware and drinkware items are distributed all around, including multiple cups, wine glasses, bottles, forks, knives, spoons, and bowls. A cell phone is also placed on the table, indicating the social atmosphere of the gathering. This scene reflects a lively dinner occasion where friends or family enjoy each other's company.", "h_value": "The image depicts a group of people gathered around a long dining table in what appears to be a restaurant setting. There are a total of eleven people present, some sitting and some standing around the table. They seem to be having dinner together and possibly posing for a photo. On the table, various tableware and drinkware items are distributed all around, including multiple cups, wine glasses, bottles, forks, knives, spoons, and bowls. A cell phone is also placed on the table, indicating the social atmosphere of the gathering. This scene reflects a lively dinner occasion where friends or family enjoy each other's company, with a menu of delicious dishes being passed around the table.", "co_objects": ["Menu or food platters", "Candles or centerpieces", "Cameras or selfie sticks"], "uncertain_objects": [], "question": "Describe this image in detail."}
{"id": "000000166464", "image": "COCO_train2014_000000166464.jpg", "value": "The image captures a charming little tea party set-up, complete with a dining table adorned with cups, saucers, and water glasses. A beautifully frosted cake is strategically placed in the middle of the table, drawing attention. A girl doll is sitting at the table, tenderly holding a tiny teddy bear in her arms. The wicker table arrangement also features a cream-filled pastry placed alongside coffee and drinks. \nThere are several cups on the table, with one closer to the doll on the left side, two cups placed further away on the right side, and another cup resting near the center of the table. In addition, there's a fork and a knife for serving the delicious cake.\nTo complete the tea party ambiance, two chairs can be seen, one on the left side of the table and another towards the front right side. The lovely tea party setting looks perfect for a little girl's special occasion or a delightful make-believe afternoon.", "h_value": "The image captures a charming little tea party set-up, complete with a dining table adorned with cups, saucers, and water glasses. A beautifully frosted cake is strategically placed in the middle of the table, drawing attention. A girl doll is sitting at the table, tenderly holding a tiny teddy bear in her arms. The wicker table arrangement also features a cream-filled pastry placed alongside coffee and drinks. \nThere are several cups on the table, with one closer to the doll on the left side, two cups placed further away on the right side, and another cup resting near the center of the table. In addition, there's a fork and a knife for serving the delicious cake. A teapot with a cozy is also visible on the table, adding to the cozy ambiance of the tea party.\nTo complete the tea party ambiance, two chairs can be seen, one on the left side of the table and another towards the front right side. The lovely tea party setting looks perfect for a little girl's special occasion or a delightful make-believe afternoon.", "co_objects": ["A floral centerpiece", "A lace tablecloth", "A teapot with a cozy"], "uncertain_objects": ["wicker", "pink", "cup", "person", "glasses", "image", "background", "blur", "people"], "question": "Describe this image in detail."}
{"id": "000000069798", "image": "COCO_train2014_000000069798.jpg", "value": "The scene is a picturesque city street with a bus stop signpost prominently visible. The road is nearly empty, giving a calm and peaceful vibe to the downtown area. A sidewalk runs alongside the road, leading toward a park in the near distance. Buildings line the city street, creating a scenic urban environment. \nThere is only one person waiting at the bus stop, standing near the pole. Several traffic lights are found along the street, controlling the flow of the sparse traffic. Scattered along the street, a few cars can be observed parked, adding to the serene atmosphere of the quiet cityscape.", "h_value": "The lone figure at the bus stop glances toward the park bench as they wait for the bus. The tranquil setting is enhanced by the nearby bicycle rack and trash can, adding to the city's charm. The sparse traffic passes by the street lined with beautiful buildings, while a few trees provide a touch of nature to the urban scene. The signpost remains visible near the pole, guiding the way for any passersby. The scattered cars parked along the street only add to the serene atmosphere of this peaceful downtown area.", "co_objects": ["Park bench", "Bicycle rack", "Trash can"], "uncertain_objects": ["street", "building", "cars", "trees", "lights", "sign", "pole"], "question": "Describe this image in detail."}
{"id": "000000160264", "image": "COCO_train2014_000000160264.jpg", "value": "The scene takes place in a unique cave setting, with a group of people gathered around a long dining table. There is a mixture of diners, some seated while others stand nearby. The atmosphere is warm and inviting as the guests enjoy drinks and conversation by candlelight.\nIn the middle of the table, multiple cups, bowls, and wine glasses are spaced out to accommodate the guests. In addition to the glassware, there are several bottles that add to the variety of beverages being consumed. The dimly lit environment encourages a feeling of relaxation and camaraderie among the diners, creating an unforgettable dining experience.", "h_value": "The candles flicker gently, casting a warm glow over the unique cave setting where the diners have gathered around a long dining table. Plates of delicious food are passed around as the guests enjoy drinks and conversation, surrounded by decorative rocks and crystals that add to the ambiance. In the background, the walls of the cave create an intimate and cozy atmosphere that encourages relaxation and connection among the group.", "co_objects": ["Candles ", "Plates of food ", "Decorative rocks or crystals as part of the unique cave setting."], "uncertain_objects": ["person", "foreground", "walls", "fireplace", "background", "atmosphere", "intimate"], "question": "Describe this image in detail."}
{"id": "000000202426", "image": "COCO_train2014_000000202426.jpg", "value": "The image features a line of shelves filled with colorful and assorted glassware. There is a wide array of wine glasses in various shapes, sizes, and colors, occupying most parts of the shelves. \nAdditionally, there are several vases of different shapes and sizes, which are spread across the shelves, complementing the wine glasses. Some vases are located at the top and bottom sections of the shelves, while others are dispersed throughout the middle area. The collection of decorative blown glasses and vases is visually appealing, creating a vibrant and interesting display.", "h_value": "The shelves are filled with stunning glassware, including a wide array of wine glasses in various shapes, sizes, and colors. Among the collection, you can also spot some beautiful crystal decanters, adding an elegant touch to the display. Complementing the wine glasses are several vases of different shapes and sizes, spread throughout the shelves. The visually appealing collection of blown glassware, crystal decanters, and vases make for a vibrant and interesting display.", "co_objects": ["Decorative plates", "Ceramic figurines", "Crystal decanters"], "uncertain_objects": ["set", "glass", "objects", "colors", "vases", "glasses", "patterns", "frame"], "question": "Describe this image in detail."}
{"id": "000000056615", "image": "COCO_train2014_000000056615.jpg", "value": "The image depicts a busy city street with various vehicles and pedestrians. In one lane, there are two police cars parked, while a bus is driving in the other lane with its door open, possibly allowing a passenger to alight.\nThere is a group of people walking on the sidewalk next to a store, some of them are carrying backpacks. At least nine individuals are visible on the sidewalk, with some pedestrians closer to the road and others further back near the storefronts. The scene captures the bustle and activity of daily life in a vibrant urban environment.", "h_value": "The image depicts a busy city street with various vehicles and pedestrians. In one lane, there are two police cars parked next to a fire hydrant, while a bus is driving in the other lane with its door open, possibly allowing a passenger to alight. There is a group of people walking on the sidewalk next to a store, some of them are carrying backpacks. At least nine individuals are visible on the sidewalk, with some pedestrians closer to the road and others further back near the storefronts. The scene captures the bustle and activity of daily life in a vibrant urban environment, with the traffic lights signaling the constant flow of movement.", "co_objects": ["Traffic lights", "Street signs", "Fire hydrants"], "uncertain_objects": ["New", "light", "person"], "question": "Describe this image in detail."}
{"id": "000000200653", "image": "COCO_train2014_000000200653.jpg", "value": "The image shows a group of tennis players on a tennis court, greeting each other after a match. There are a total of nine people in the scene, with most of them standing near the middle of the court. Some of the players are shaking hands, while others are bumping fists as a sign of sportsmanship.\nOne tennis racket is lying on the court, indicating that the players have just finished their game. The players are all dressed in athletic attire, and they seem to be in good spirits, creating a positive and friendly atmosphere.", "h_value": "The image shows a group of tennis players on a tennis court, greeting each other after a match. One of the players is holding a tennis ball, while some are shaking hands and others are bumping fists as a sign of sportsmanship. There are a total of nine people in the scene, with most of them standing near the middle of the court. One tennis racket is lying on the court, indicating that the players have just finished their game. The players are all dressed in athletic attire, and they seem to be in good spirits, creating a positive and friendly atmosphere.", "co_objects": ["Tennis ball", "Water bottles", "Towels"], "uncertain_objects": ["people", "outfits", "shoes", "racquets"], "question": "Describe this image in detail."}
{"id": "000000448985", "image": "COCO_train2014_000000448985.jpg", "value": "The image features a large refrigerated cooler case in a store, stocked full of a wide assortment of canned and bottled beverages. The cooler spans almost the entire visible frame, with the beverages placed on various shelves within it. \nThere are numerous bottles of different shapes and sizes displayed throughout the refrigerator. Some bottles can be seen at the top of the fridge close to the edges, and others are placed in the middle and lower sections. The selection of beverages also consists of several cans, offering customers a variety of cold drinks to choose from.", "h_value": "The image shows a large refrigerated cooler case in a store, stocked full of a wide assortment of canned and bottled beverages. The cooler is equipped with a glass door, allowing customers to easily view the drinks inside. Numerous price tags or labels can be seen on the shelves, indicating the different brands and flavors available. Customers can grab a shopping cart or basket to carry their chosen beverages in.", "co_objects": ["Price tags or labels", "A glass door or cover for the refrigerator", "A shopping cart or basket for customers to carry their chosen beverages in."], "uncertain_objects": ["beverages", "beer", "liquor", "glass", "drawers", "tidy", "marks", "damage"], "question": "Describe this image in detail."}
{"id": "000000554066", "image": "COCO_train2014_000000554066.jpg", "value": "The image shows a brown and white kitchen viewed from the perspective of its counter bar stools. The kitchen is equipped with a white refrigerator, a metal sink, an oven, and a microwave. On the countertop, there is a toaster, two bowls placed next to each other, and two cups. \nIn the seating area, there are two chairs positioned near the kitchen counter. Various books and notebooks are scattered around the room, with one book lying on the counter, another near the sink, and a larger book placed on the floor. Additionally, there are signs placed on the counter among these items, adding to the cozy and lived-in atmosphere of the kitchen.", "h_value": "The brown and white kitchen, viewed from the counter bar stools, features a metal sink and various cozy touches, including signs and scattered books. On the countertop, there are two bowls, two cups, and a toaster, along with a Dish rack. The seating area boasts two chairs positioned near the counter, while a Paper towel holder hangs nearby. The lived-in atmosphere is enhanced by the Cutting board and other uncertain_objects that adorn the walls.", "co_objects": ["Cutting board", "Dish rack", "Paper towel holder"], "uncertain_objects": ["sink", "walls"], "question": "Describe this image in detail."}
{"id": "000000554949", "image": "COCO_train2014_000000554949.jpg", "value": "The image features a group of three people, likely chefs or aspiring chefs, working together in a kitchen to prepare food. The kitchen crew appears to be focused on their work and using various tools and kitchenware. \nThere are two knives on the counter, suggesting the chefs have been chopping or cutting ingredients. Multiple spoons are present, possibly being used for mixing or serving. Additionally, there are several cups and bowls scattered across the kitchen, indicating that the chefs are working on multiple dishes or preparing several components of a dish. A sink is also visible in the kitchen, signifying that the area is designed for both food preparation and cleaning.", "h_value": "The image features a group of three people, likely chefs or aspiring chefs, working together in a kitchen to prepare food. The kitchen crew appears to be focused on their work and using various tools and kitchenware. One of the chefs is seen using a whisk or spatula to mix ingredients in a mixing bowl, while another is cutting vegetables on a cutting board with a knife. Multiple spoons are present, possibly being used for mixing or serving. Additionally, there are several cups and bowls scattered across the kitchen, indicating that the chefs are working on multiple dishes or preparing several components of a dish. A sink is also visible in the kitchen, signifying that the area is designed for both food preparation and cleaning. Although it's uncertain whether the chefs are working in a restaurant or not, they are not wearing gloves in the image.", "co_objects": ["Cutting board", "Mixing bowls", "Whisk or spatula"], "uncertain_objects": ["restaurant", "gloves", "knife"], "question": "Describe this image in detail."}
{"id": "000000115917", "image": "COCO_train2014_000000115917.jpg", "value": "The image features two main tennis players shaking hands after a match. They are standing in the center, facing each other as a gesture of sportsmanship. Both players are holding tennis rackets in their hands.\nIn the scene, there are also some other people in various locations, perhaps as teammates or supportive audience members. Additionally, there are a few chairs and a bench present, likely to provide seating for the other people or serve as a resting area for the players.", "h_value": "The image features two main tennis players shaking hands after a match. They are standing in the center, facing each other as a gesture of sportsmanship. Both players are holding tennis rackets in their hands. Among the other people present, the teammates/supportive audience members can be seen cheering on the players. Additionally, there are a few chairs and a bench present, likely to provide seating for the other people or serve as a resting area for the players.", "co_objects": ["Teammates/supportive audience members", "Chairs", "Bench"], "uncertain_objects": [], "question": "Describe this image in detail."}
{"id": "000000566762", "image": "COCO_train2014_000000566762.jpg", "value": "The image features a large red, white, and blue airplane parked on a runway. It appears to be in the process of unloading, as passengers are getting off. A group of people stand around the plane on the tarmac, likely waiting to collect their luggage, greet arriving loved ones, or prepare for their next leg of travel. \nThere are 15 people visible in the scene, standing individually or in small clusters around the airplane. Some are positioned closer to the left side of the plane, while others are near the center or the right side of it. The scene is full of activity, demonstrating the hustle and bustle that is typical at airports around the world.", "h_value": "The image features a group of airport personnel using luggage carts to unload suitcases from the large red, white, and blue airplane parked on the runway. Passengers are seen getting off the plane while a group of people stand around, likely waiting to collect their luggage. There are 15 people visible in the scene, positioned around the plane. Despite the hustle and bustle, the wings, front, cockpit, and tail of the plane remain stationary.", "co_objects": ["Luggage carts", "Airport personnel", "Suitcases"], "uncertain_objects": ["People", "wings", "front", "cockpit", "tail"], "question": "Describe this image in detail."}
{"id": "000000233500", "image": "COCO_train2014_000000233500.jpg", "value": "The image depicts a person wearing a hat and traditional-style clothing riding a brown horse down a street. The horse and its rider are colorfully dressed, possibly for a parade or a cultural event. Many spectators are seen watching the event from the sidelines, standing at various points along the street. \nAdditionally, there are several cars parked along the side of the street, blending into the background of the scene. Some of the cars are closer to the foreground, while others are farther back, symbolizing a bustling urban setting for this traditional display.", "h_value": "The image depicts a person wearing a hat and traditional-style clothing riding a brown horse down a street. The horse and its rider are colorfully dressed, possibly for a parade or a cultural event. Many spectators are seen watching the event from the sidelines, standing at various points along the street. Flags or banners hanging from buildings or poles along the street add to the festive atmosphere. Additionally, there are several cars parked along the side of the street, blending into the background of the scene. Some of the cars are closer to the foreground, while others are farther back, symbolizing a bustling urban setting for this traditional display.", "co_objects": ["Flags or banners hanging from buildings or poles along the street", "Musicians playing traditional music on the side of the street", "Vendors selling food or souvenirs to the spectators"], "uncertain_objects": ["outfit", "banner", "scene", "atmosphere", "words"], "question": "Describe this image in detail."}
{"id": "000000434319", "image": "COCO_train2014_000000434319.jpg", "value": "The image shows a busy subway station with multiple people going about their day. Notably, a woman wearing an overcoat and stockings is standing against a wall on a tile floor, looking at her cell phone. \nOther passengers are present, with some nearby the woman and others scattered throughout the station. Various pieces of luggage can be seen in the area, including a handbag, a suitcase, and a backpack, suggesting people are either coming from or heading to their destinations.\nThe busy atmosphere and the focus on people's activities, such as using cell phones, reflect the typical scene at a subway station.", "h_value": "The image shows a woman standing against a wall on a tile floor, looking at her cell phone in a busy subway station. A train arriving/departing board can be seen in the background, along with various pieces of luggage. The typical scene is complete with a ticket vending machine and subway map nearby.", "co_objects": ["Ticket vending machine", "Subway map", "Train arriving/departing board"], "uncertain_objects": ["subway", "wall", "phone", "floor", "form", "frame"], "question": "Describe this image in detail."}
{"id": "000000322405", "image": "COCO_train2014_000000322405.jpg", "value": "In the image, a woman with a broken foot is using a walker in her home's kitchen. The kitchen features a dining table with chairs, a microwave, an oven, and a sink. On the table, there are multiple bowls and a cup. Throughout the kitchen, several bottles can be seen, possibly containing ingredients or beverages. A potted plant is also visible in the room, adding a touch of greenery. Nearby, there is a handbag on the floor, likely belonging to the woman.", "h_value": "In the image, the woman with a broken foot is using crutches to move around the kitchen. The kitchen features a dining table with chairs, a microwave, an oven, and a sink. On the table, there are multiple bowls and a cup. Throughout the kitchen, several medication bottles can be seen, possibly belonging to the woman. A potted plant is also visible in the room, adding a touch of greenery. Nearby, there are kitchen towels on the countertop, ready for use.", "co_objects": ["Crutches", "Medication bottles", "Kitchen towels"], "uncertain_objects": ["kitchen", "walls", "stairs", "pink", "backpack"], "question": "Describe this image in detail."}
{"id": "000000179504", "image": "COCO_train2014_000000179504.jpg", "value": "In the image, there is a man wearing a suit intently listening to his cell phone. He appears to be having a serious conversation. Standing nearby is a woman who is closely watching the man, possibly concerned or intrigued by the discussion. She is eating a lollipop while observing the man on the phone. \nThere are other individuals present in the image, one near the man in the suit and another toward the right side of the image. A handbag can also be spotted, placed near the first person. The man in the suit is wearing a tie, adding a formal touch to his attire.", "h_value": "In the image, the man wearing a suit is holding a coffee cup while intently listening to his cell phone. He appears to be having a serious conversation. Standing nearby is a woman who is closely watching the man, possibly concerned or intrigued by the discussion. She is eating a lollipop while observing the man on the phone. \nThere are other individuals present in the image, one near the man in the suit and another toward the right side of the image. A briefcase can also be spotted, placed near the first person. The man in the suit is wearing a tie, adding a formal touch to his attire.", "co_objects": ["Chair", "Coffee cup", "Briefcase"], "uncertain_objects": ["man", "people"], "question": "Describe this image in detail."}
{"id": "000000400592", "image": "COCO_train2014_000000400592.jpg", "value": "The image depicts a computer desk in the corner of a room, with a computer monitor and keyboard placed on top of it. A chair is positioned in front of the desk, facing the computer. \nThe room and desk are indeed messy and cluttered, with papers scattered all over. Several books can be found on the desk and throughout the room, alongside a cell phone and a cup. A computer mouse is also placed on the desk, slightly to the right of the keyboard.\nOverall, the scene conveys the idea of a disorganized workspace that could use some tidying up.", "h_value": "The image depicts a cluttered computer desk in the corner of a room, with a computer monitor, keyboard, and headphones placed on top of it. A chair is positioned in front of the desk, facing the computer. \nThe room and desk are covered in papers, books, and various objects, including a pen and notepad. A cell phone and a cup can also be found on the desk. Despite the mess, the headphones suggest that the occupant is focused on their work and trying to tune out distractions. The scene conveys the idea of a busy, but disorganized workspace that could use some tidying up.", "co_objects": ["Pen", "Notepad", "Headphones"], "uncertain_objects": ["printer", "papers", "books", "mountain", "landscape"], "question": "Describe this image in detail."}
{"id": "000000549924", "image": "COCO_train2014_000000549924.jpg", "value": "The image depicts a group of people gathered in a room, enjoying leisure time together. Three persons are visible in the scene, participating in playing a video game using Wii remotes. A mounted TV screen can be seen, where the game is being displayed.\nThe room features a dining table with several books scattered across it. Surrounding the table, there are a couple of chairs placed, including one in the foreground and another near the far end of the table. An additional chair is visible in the background. In the scene, a sports ball can also be spotted on a surface. The people seem engaged in the activity, showcasing a fun, social atmosphere.", "h_value": "The image depicts a group of people gathered in a room, enjoying leisure time together. Three persons are visible in the scene, participating in playing a video game using Wii remotes. A mounted TV screen can be seen, where the game is being displayed.\n\nThe room features a dining table with several books scattered across it. Surrounding the table, there are a couple of chairs placed, including one in the foreground and another near the far end of the table. An additional chair is visible in the background. In the scene, a sports ball can also be spotted on a surface. The people seem engaged in the activity, showcasing a fun, social atmosphere.\n\nSnacks or drinks are placed on the table, adding to the enjoyable vibe.", "co_objects": ["Snacks or drinks", "Couch or sofa", "Gaming console or additional game controllers"], "uncertain_objects": ["table", "front", "study"], "question": "Describe this image in detail."}
{"id": "000000108321", "image": "COCO_train2014_000000108321.jpg", "value": "The image captures a military lorry driving on a highway alongside other cars. The military truck is carrying a group of soldiers, with five officers visible in the back. They are likely being transported for a mission or to their next station. The highway has cars in the foreground, with one car located in front of the lorry, another alongside it, and a third further ahead on the road. There is also another truck parked next to the military vehicle, demonstrating the busy nature of the highway.", "h_value": "The image captures a military lorry driving on a highway alongside other cars. The military truck is being escorted by a police car, with five officers visible in the back. They are likely being transported for a mission or to their next station. The highway has traffic cones in the foreground, with one car located in front of the lorry, another alongside it, and a third further ahead on the road. There is also a road sign indicating the speed limit, and another truck parked next to the military vehicle, demonstrating the busy nature of the highway.", "co_objects": ["Road signs", "Traffic cones", "Police escort car"], "uncertain_objects": ["metal", "camouflage", "weapons", "driving"], "question": "Describe this image in detail."}
{"id": "000000559358", "image": "COCO_train2014_000000559358.jpg", "value": "The image depicts a spacious flower shop filled with multiple colorful flowers and a variety of vases. Multiple potted plants are displayed throughout the store, with some near the entrance and others further back in the shop. There are at least 14 distinct vases, varying in color and size, placed around the space. These vases are also displayed on a wall in the shop, adding to the visual variety.\nIn addition to the vases and potted plants, the shop has a collection of bottles, possibly containing water, plant food, or other items used in flower arrangement. There are at least 10 bottles of various sizes scattered around the store, creating an atmosphere of a place where customers can find everything they need for their floral needs. The shop is well-stocked, offering a large selection of flower arrangements and supplies for customers.", "h_value": "The flower shop offers a wide array of garden tools, such as pruning shears and watering cans, alongside their beautiful flower arrangements and vases. The shelves are stocked with items to help customers create their own floral displays at home. Decorative signage and posters promoting the floral business adorn the walls, creating a welcoming atmosphere for visitors. The stunning glass vases, potted plants, and various types of flowers on display make the shop a true floral paradise. Despite the busy floor, the shop is well-organized and easy to navigate.", "co_objects": ["Flower arrangements", "Garden tools (such as pruning shears, watering cans, or gloves)", "Decorative signage or posters promoting the floral business"], "uncertain_objects": ["shop", "shelves", "items", "glass", "types", "food", "floor"], "question": "Describe this image in detail."}
{"id": "000000096360", "image": "COCO_train2014_000000096360.jpg", "value": "The image features a table covered with a variety of delicious donuts laid out for sale. There are eleven donuts on display, with some positioned closer to the front, while others are further back on the table. The donuts come in different shapes and sizes, each glazed with powdered sugar or frosting, adding an appetizing touch to their appearance. Natural light can be seen illuminating the donuts, highlighting their scrumptious texture and making them look even more inviting. They are all ready to be bought and enjoyed by eager customers.", "h_value": "The image features a table covered with a variety of delicious donuts laid out for sale. There are eleven donuts on display, with some positioned closer to the front, while others are further back on the table. The donuts come in different shapes and sizes, each glazed with powdered sugar or frosting, adding an appetizing touch to their appearance. Natural light can be seen illuminating the donuts, highlighting their scrumptious texture and making them look even more inviting. They are all ready to be bought and enjoyed by eager customers. Price tags can be seen placed next to each donut, and napkins and coffee cups are available for customers to use with their purchases.", "co_objects": ["Napkins", "Coffee cups", "Price tags"], "uncertain_objects": ["doughnuts", "front"], "question": "Describe this image in detail."}
{"id": "000000445111", "image": "COCO_train2014_000000445111.jpg", "value": "The image depicts a lively scene of a group of people, including three little boys and three women, standing and laughing while playing a video game in a living room. They are all holding Nintendo Wii controllers, fully engaged in the interactive gameplay.\nThe living room features a dining table in the background accompanied by a chair, and a couch located closer to the center of the room. On the dining table, there are numerous cups and a collection of books, suggesting a cozy and welcoming atmosphere. Overall, the image captures a joyous moment shared by the group as they enjoy a fun time together.", "h_value": "The image depicts a lively scene of a group of people, including three little boys and three women, standing and laughing while playing a video game in a living room. They are all holding Nintendo Wii controllers, fully engaged in the interactive gameplay. Snacks or food on a nearby table can be seen, suggesting the group is enjoying refreshments while they play. The living room features a dining table in the background accompanied by a chair, and a couch located closer to the center of the room. On the dining table, there are numerous cups and a collection of books, suggesting a cozy and welcoming atmosphere. Overall, the image captures a joyous moment shared by the group as they enjoy a fun time together.", "co_objects": ["Television screen", "Coffee table", "Snacks or food on a nearby table"], "uncertain_objects": ["room", "table", "fireplace", "plants", "outfits"], "question": "Describe this image in detail."}
{"id": "000000164687", "image": "COCO_train2014_000000164687.jpg", "value": "The image depicts a city street scene on a cloudy day with no traffic in sight. In the foreground, there is a street sign pointing to the direction of 25 North, accompanied by a traffic light. Another traffic light is also visible further down the road. \nThere are several parked cars at various locations along the street, contributing to the urban atmosphere. A pedestrian is present on the sidewalk, possibly out for a stroll or waiting to cross the road. A few buildings are visible in the background, completing the cityscape.", "h_value": "The image depicts a city street scene on a cloudy day with no traffic in sight. In the foreground, there is a street sign pointing to the direction of 25 North, accompanied by a traffic light and a fire hydrant. Another traffic light is also visible further down the road. \nThere are several parked cars at various locations along the street, contributing to the urban atmosphere. A pedestrian is present on the sidewalk, possibly out for a stroll or waiting to cross the road. A few buildings are visible in the background, completing the cityscape.", "co_objects": ["Fire hydrant", "Bench", "Trash can"], "uncertain_objects": ["overpass", "group", "buses", "clouds", "hint"], "question": "Describe this image in detail."}
{"id": "000000280651", "image": "COCO_train2014_000000280651.jpg", "value": "The image depicts a grill filled with a large number of hot dogs, with at least fifteen of them cooking on the grill. Several hot dog buns are also placed on the grill, resting comfortably on top of the hot dogs. The grill practically covers the entire scene as the focus remains on the hot dogs and buns.\nAdditionally, there are a few carrots in the scene, with two of them positioned at the top of the image and another one located slightly lower. The carrots provide a contrasting element to the dominant presence of the hot dogs and buns.", "h_value": "The image depicts a grill filled with a large number of hot dogs, with at least fifteen of them cooking on the grill. Several hot dog buns are also placed on the grill, resting comfortably on top of the hot dogs. The grill practically covers the entire scene as the focus remains on the hot dogs and buns. A Ketchup bottle can be seen on the side of the grill, ready to be used for those who prefer to add some extra flavor. Additionally, there are a few carrots in the scene, with two of them positioned at the top of the image and another one located slightly lower. The carrots provide a contrasting element to the dominant presence of the hot dogs and buns, while the Ketchup bottle adds to the overall deliciousness of the scene.", "co_objects": ["Grill tongs", "Ketchup bottle", "Mustard bottle"], "uncertain_objects": ["kitchen", "processing", "area."], "question": "Describe this image in detail."}
{"id": "000000538993", "image": "COCO_train2014_000000538993.jpg", "value": "The scene shows a group of people standing outside on a rainy day in a metropolitan area, with umbrellas protecting them from the rain. There are seven people visible in total. One of the women is a beautiful blonde standing under an umbrella next to a large pillar. Another woman, wearing a knitted hat, is also standing under an umbrella. \nThe people are walking along a sidewalk next to buildings, trying to navigate the wet conditions while carrying umbrellas. Two large umbrellas are prominently visible in the scene, sheltering individuals from the rain. Additionally, a handbag can be seen near the center of the image, possibly belonging to one of the people in the scene.", "h_value": "The scene shows a group of people standing outside on a rainy day in a metropolitan area, with umbrellas protecting them from the rain. One of the women is holding a coffee cup from a nearby café, trying to keep warm in the chilly weather. There are puddles on the ground from the rain, making it difficult to navigate the sidewalk. The street sign indicating the name of the road is partially obscured by the large umbrellas sheltering individuals from the rain. The mood in the scene is somber, as the people try to make the best of the wet conditions while walking along the dimly lit street.", "co_objects": ["Puddles on the ground from the rain", "A street sign indicating the name of the road", "A coffee cup or takeaway cup from a nearby café"], "uncertain_objects": ["women", "umbrellas", "street", "lights", "mood"], "question": "Describe this image in detail."}
{"id": "000000283720", "image": "COCO_train2014_000000283720.jpg", "value": "In this image, a small cat can be seen sitting on the ground, looking up and watching a large TV. The television is displaying some video games, while the cat is positioned near the center of the scene, attentively observing the screen.\nThere are also several people scattered throughout the room. Two people are behind the cat towards the left, another person is on the right side, and another person is in the top left corner of the image, partially obscured from view. \nVarious items, such as bottles and books, are scattered around the room. There are two bottles, one placed nearer to the right side and the other one in the lower-left region. Several books can be found on the ground, mostly on the right side of the room, aligning horizontally in the center area.", "h_value": "In this image, a small cat can be seen sitting on the ground, clutching the video game controllers tightly in its paws while looking up and watching a large TV. The television is displaying some exciting gameplay, while the cat is positioned near the center of the scene, attentively observing the screen. The comfortable sofa or chairs can be seen prominently in the foreground, while the coffee table is situated in the background. \n\nThere are also several people scattered throughout the room. Two people are behind the cat towards the left, another person is on the right side, and another person is in the top left corner of the image, partially obscured from view. \n\nVarious items, such as bottles and books, are scattered around the room. There are two bottles, one placed nearer to the right side and the other one in the lower-left region. Several books can be found on the ground, mostly on the right side of the room, aligning horizontally in the center area. The windows, shelves, objects, and clock are visible in the background, adding to the overall ambiance of the scene.", "co_objects": ["Video game controllers", "Sofa or chairs", "Coffee table"], "uncertain_objects": ["entertainment", "background", "windows", "shelves", "objects", "clock"], "question": "Describe this image in detail."}
{"id": "000000197854", "image": "COCO_train2014_000000197854.jpg", "value": "In the image, a group of four people stands together on a snow-covered hill, each of them holding a snowboard. They are surrounded by trees, showcasing the beautiful winter landscape. The snowboarders are all looking as though they are enjoying the experience and camaraderie. Each of their snowboards is oriented vertically, adding a sense of uniformity to the scene.", "h_value": "In the image, a group of four people wearing ski jackets stands together on a snow-covered hill, each of them holding a snowboard. They are surrounded by trees, showcasing the beautiful winter landscape. The snowboarders are all looking as though they are enjoying the experience and camaraderie, with their goggles protecting their eyes from the bright snow. Each of their snowboards is oriented vertically, adding a sense of uniformity to the scene. Despite the chill, their warm snow boots keep their feet cozy.", "co_objects": ["Ski jackets", "Goggles", "Snow boots"], "uncertain_objects": ["helmets", "range"], "question": "Describe this image in detail."}
{"id": "000000541999", "image": "COCO_train2014_000000541999.jpg", "value": "The image captures a bustling airport terminal where a group of passengers is seen walking with their luggage. At least five people are visible in the scene, each moving through the terminal with suitcases and handbags in tow. Some of the suitcases are on wheels, making it more convenient for the passengers to navigate the busy space.\nA variety of suitcases and handbags are spread throughout the scene, with at least five suitcases and four handbags visible. There is also a book present in the image, likely held or placed close to one of the passengers. The people are at various distances from the camera, conveying the dynamic atmosphere of the airport terminal.", "h_value": "The image captures a bustling airport terminal where a group of passengers is seen walking with their luggage towards the airline ticket counters. At least five people are visible in the scene, each moving through the terminal with suitcases and handbags in tow. Some of the suitcases are on wheels, making it more convenient for the passengers to navigate the busy space.\nA variety of suitcases and handbags are spread throughout the scene, with at least five suitcases and four handbags visible. There is also a book present in the image, likely held or placed close to one of the passengers. The people are at various distances from the camera, conveying the dynamic atmosphere of the airport terminal.", "co_objects": ["Airport signage", "Rolling luggage carts", "Airline ticket counters"], "uncertain_objects": [], "question": "Describe this image in detail."}
{"id": "000000085326", "image": "COCO_train2014_000000085326.jpg", "value": "The image displays a unique outdoor scene, where numerous stuffed dummies are posed as if engaging in various activities. These dummies are arranged around a small building in a field, giving the appearance of a lively gathering. Many of the dummies are sitting on bicycles or motorcycles, while some are seated on benches or standing next to other dummies. \nSpecifically, there are at least six bicycles spread throughout the scene, with one in the background, two on the left, two closer to the center, and one on the right. A motorcycle is visible on the left side of the image. Two benches can be seen, one located in the center and the other towards the right. Among the dummies, at least nine distinct figures are noticeable, interacting with the bikes, benches, and each other. This whimsical setup resembles a town of scarecrows participating in everyday activities.", "h_value": "The image showcases a vibrant gathering of scarecrow figures engaging in various activities around a small building in a field, with trees or shrubs visible in the background. Among the whimsical scene, at least six bicycles and one motorcycle can be spotted, with two benches providing seating options. The atmosphere is playful and lighthearted, with the scarecrows appearing to enjoy their everyday activities.", "co_objects": ["Small building", "Scarecrows", "Trees or shrubs in the background"], "uncertain_objects": ["petrol", "setting", "atmosphere"], "question": "Describe this image in detail."}
{"id": "000000235996", "image": "COCO_train2014_000000235996.jpg", "value": "The image captures a baseball game in progress, with a batter in an orange shirt standing in the batter's box, preparing to swing at the ball. He is holding a baseball bat, which he has raised and is ready to hit the ball as it comes toward him in play. \nIn the scene, there are several other people, likely teammates and opponents, dispersed across the field. They seem to be strategically positioned, focused on the ongoing game action. Overall, it is a lively and engaging sports scene with everyone invested in the outcome.", "h_value": "The batter in the orange shirt is focused on the game, gripping his baseball bat tightly as he prepares to swing at the ball. Behind him, the umpire behind home plate watches closely, ready to make a call. The players on the field are strategically positioned, with baseball gloves and helmets at the ready. In the backdrop, the stadium is filled with cheering fans, all invested in the outcome of the game.", "co_objects": ["Baseball glove", "Umpire behind home plate", "Baseball helmet"], "uncertain_objects": ["mid-swing", "batter", "backdrop", "stadium", "group"], "question": "Describe this image in detail."}
{"id": "000000320374", "image": "COCO_train2014_000000320374.jpg", "value": "The image depicts a large, old country house with another large house beside it, surrounded by lush greenery. In the yard around the houses, numerous sheep are grazing peacefully, creating a calm and idyllic atmosphere. \nIn the outdoor area, there are several chairs scattered throughout, as well as a bench, suggesting a space for relaxation and enjoying the natural setting. Potted plants can also be seen, further enhancing the verdant landscape. \nA truck and a car are parked nearby, indicating the presence of people, likely the residents of the houses or visitors. The scene overall represents a quaint and serene country lifestyle.", "h_value": "The image depicts a large, old country house with another large house beside it, surrounded by lush greenery. In the yard around the houses, numerous sheep are grazing peacefully, creating a calm and idyllic atmosphere. \nIn the outdoor area, there are several chairs scattered throughout, as well as a bench, suggesting a space for relaxation and enjoying the natural setting. A birdhouse can also be seen nestled among the trees, adding a charming touch to the verdant landscape. \nA truck and a car are parked nearby, indicating the presence of people, likely the residents of the houses or visitors. The scene overall represents a quaint and serene country lifestyle.", "co_objects": ["Garden tools (such as a rake or shovel) ", "A watering can ", "A birdhouse or bird feeder"], "uncertain_objects": ["wraparound", "dirt", "trees", "bay", "barn", "cows", "background"], "question": "Describe this image in detail."}
{"id": "000000019938", "image": "COCO_train2014_000000019938.jpg", "value": "The image features a display of antique motorcycles, including a prominent old Hale motorcycle, positioned on a grassy area. There are several other vintage motorcycles of varying styles and sizes scattered throughout the scene.\nA group of people are gathered behind the motorcycles, taking in the sight and admiring the collection. Some of them are standing closer to the back, while others are positioned near the middle or the right side of the scene. Their presence shows the interest in the history and craftsmanship of these classic motorcycles.", "h_value": "The image showcases a collection of antique motorcycles, including a striking old Hale motorcycle, displayed on a grassy area. Vintage helmets are also present, adding to the nostalgic ambiance. A group of people has gathered to admire the craftsmanship and history of these classic bikes, with some sporting leather jackets. Antique tools for motorcycle repair are scattered throughout the scene, highlighting the attention to detail and care that went into maintaining these mechanical marvels.", "co_objects": ["Vintage helmets", "Leather jackets", "Antique tools for motorcycle repair"], "uncertain_objects": ["banner", "driver"], "question": "Describe this image in detail."}
{"id": "000000519188", "image": "COCO_train2014_000000519188.jpg", "value": "The image features a small prop-style airplane on an airport tarmac, with a group of people exiting the aircraft. There are several individuals standing outside the airplane, including a small group of people near the middle and a couple of others further away from the plane. Some passengers are holding their handbags, while another has a backpack.\nThe airplane as the main subject spans nearly the entire width of the picture, with its nose positioned low in the frame and its tail extending toward the top of the image. The passengers appear to be unloading from a private plane at an airstrip, ready to continue their journey.", "h_value": "The image features a small prop-style airplane on an airport tarmac, with a group of people exiting the aircraft. There are several individuals standing outside the airplane, including a small group of people near the middle and a couple of others further away from the plane. Some passengers are holding their handbags, while another has a backpack. A fuel truck can be seen in the background, parked near the runway. \n\nThe airplane as the main subject spans nearly the entire width of the picture, with its nose positioned low in the frame and its tail extending toward the top of the image. The passengers appear to be unloading from a private plane at an airstrip, ready to continue their journey.", "co_objects": ["Luggage carts", "Airport terminal building", "Fuel truck"], "uncertain_objects": ["luggage"], "question": "Describe this image in detail."}
{"id": "000000201322", "image": "COCO_train2014_000000201322.jpg", "value": "The image features a little boy sitting in a chair, his focus diverted elsewhere while holding a doughnut in his hand. The boy is wearing overalls, making the scene more playful and casual. In addition to this boy, there are other people present in the background. Two of them are closer to one another, while the third person is slightly further away in the scene. There is another chair placed nearby but without anyone sitting on it.", "h_value": "The image features a little boy sitting in a chair, his focus diverted elsewhere while holding a doughnut in his hand and a coffee mug placed on the table nearby. The boy is wearing overalls, making the scene more playful and casual. In addition to this boy, there are other people present in the background. Two of them are closer to one another, while the third person is slightly further away in the scene. There is another chair placed nearby but without anyone sitting on it. The atmosphere is lively with a newspaper lying on the table and people enjoying their coffee.", "co_objects": ["Napkin", "Coffee mug", "Newspaper"], "uncertain_objects": ["doughnut", "group", "doughnut."], "question": "Describe this image in detail."}
{"id": "000000422279", "image": "COCO_train2014_000000422279.jpg", "value": "The scene is a black and white shot of the interior of a mass transit passenger train, featuring several commuters. A man is talking on a cell phone, with the phone visible close to his ear. He is also reaching under his jacket with his other hand, holding a suitcase.\nNearby, there is a woman sitting on one of the train's chairs, her eyes closed as if sleeping. She is holding a handbag on her lap and wearing a scarf. The train has multiple seats and chairs throughout the space, and some windows can be seen on the side of the train.\nIn addition to the main train car, there are other vehicles visible in the background, such as a truck and a car, suggesting that the train is most likely at a station or moving through an urban environment.", "h_value": "The man on the train is multitasking, talking on his cell phone and holding a suitcase while reaching under his coat. Meanwhile, a woman sleeps with her eyes closed, holding a handbag and wearing a scarf. Other commuters can be seen throughout the train, with some reading newspapers or sipping coffee. In the background, vehicles like a truck and car suggest the train is in an urban environment. The man is wearing earbuds, listening to music while he talks on the phone.", "co_objects": ["Newspaper or magazine", "Coffee or beverage cup", "Earbuds or headphones"], "uncertain_objects": ["man", "coat"], "question": "Describe this image in detail."}
{"id": "000000402702", "image": "COCO_train2014_000000402702.jpg", "value": "The scene features a picturesque image of a lighthouse overlooking the ocean. The lighthouse appears to be a prominent tower near the sea with an artistic rendering of birds flying around it. There are a total of nine birds in the sky, some flying closer to the lighthouse, while others are flying at varying distances. Their positions portray a lively and dynamic atmosphere, with the lighthouse acting as the focal point and the beach as the backdrop.", "h_value": "The waves crashing against the shore create a soothing background sound for the picturesque image of the lighthouse overlooking the ocean. The lighthouse appears to be a prominent tower near the sea with an artistic rendering of birds flying around it. There are a total of nine birds in the sky, some flying closer to the lighthouse, while others are flying at varying distances. Their positions portray a lively and dynamic atmosphere, with the lighthouse acting as the focal point and the beach as the backdrop. Seagulls on the beach add to the serene setting, completing the tranquil scene.", "co_objects": ["Waves crashing against the shore", "Sailboats in the distance", "Seagulls on the beach"], "uncertain_objects": ["light", "sky", "shrubs"], "question": "Describe this image in detail."}
{"id": "000000445323", "image": "COCO_train2014_000000445323.jpg", "value": "In the image, there is a group of sailors gathered in a control room aboard a boat. There are six people in total, including a navy commander, who is using a radio or walkie-talkie system to communicate with someone. The sailors appear to be working together and discussing their tasks in front of the control area.\nThe room is equipped with various pieces of technology to assist the sailors in their work. There are two keyboards, one placed in the middle and the other towards the bottom right side of the control area. A laptop is positioned on the left side of the room, while a mouse can be seen close to the laptop setup. The sailors appear to be dressed in uniform, with several of them wearing ties as part of their attire.", "h_value": "In the image, the navy commander is seen using a headset communication device to speak with another party. The sailors are gathered around the radar screen, monitoring the ship's surroundings and using navigation charts to guide their course. The dials and monitoring systems in the control area provide additional information to assist with their tasks.", "co_objects": ["Radar screen", "Navigation charts", "Headset communication devices"], "uncertain_objects": ["dials", "microphone", "monitoring"], "question": "Describe this image in detail."}
{"id": "000000526337", "image": "COCO_train2014_000000526337.jpg", "value": "The image captures two people riding a blue and black sports motorcycle down the street. The rider in the front is maneuvering the motorcycle, while the second person is sitting on the back, dressed in black.\nIn addition to the motorcycle riders, there are four other people in the scene, walking or standing on the sidewalk. Two of them are carrying handbags. The street features a crosswalk and a traffic light above the riders' heads. Furthermore, there are two cars in the background on the right side of the image, possibly waiting for the traffic light to change.", "h_value": "The image showcases two people riding a blue and black sports motorcycle down the street, with two cars in the background waiting for the traffic light to change. The rider in the front is skillfully maneuvering the motorcycle while the second person, dressed in black, sits comfortably on the back. Additionally, four people can be seen on the sidewalk, two of them carrying handbags, and a crosswalk signal is visible.", "co_objects": ["Crosswalk signal", "Handbags", "Cars"], "uncertain_objects": ["driving", "passenger", "man", "helmet", "leather", "woman", "scene", "street", "puddles"], "question": "Describe this image in detail."}
{"id": "000000519337", "image": "COCO_train2014_000000519337.jpg", "value": "The image features a kitchen scene with a black cat peeking over the top of a toaster oven. The cat is sitting behind the oven, positioned near the center of the counter, and curiously observing the surroundings.\nThere are several knives on the counter, scattered in various positions mainly toward the left side of the image. In addition to the knives, a pair of scissors can be found among them. Near the oven, two wine glasses are placed, one closer to the left, and another towards the right side. The kitchen appears well-equipped and organized for cooking and preparing meals.", "h_value": "The image features a well-equipped kitchen scene with a black cat peeking over the top of a toaster oven. The cat is curiously observing the surroundings while sitting behind the oven, positioned near the center of the counter. Among the scattered knives and tools, a cutting board can be found towards the left side of the image. In addition, two wine glasses are placed near the oven, one closer to the left and another towards the right side. A coffee maker and a cookbook may also be present in this organized kitchen.", "co_objects": ["Cutting board", "Coffee maker", "Cookbook"], "uncertain_objects": ["kitchen", "toaster", "knives", "tools", "tail"], "question": "Describe this image in detail."}
{"id": "000000082301", "image": "COCO_train2014_000000082301.jpg", "value": "The image captures two men sitting together on a large couch, bonding and enjoying a leisurely time. One man is holding a TV remote, while the other is holding a book. Both of them share a laugh as they pose for the camera, showcasing the items in their hands. \nIn the room, there are various books scattered around, making the room appear to be a cozy space for relaxation and reading. Beside the couch, a chair can be seen in the foreground, with two more chairs situated nearby. A dining table is visible on the right side of the room. A handbag is placed in the lower-left part of the scene, adding to the casual atmosphere.", "h_value": "The cozy living room is complete with a coffee table adorned with a lamp and a throw pillow, creating a comfortable space for the two men to bond over their interests. The books scattered around and the paperback in the man's hand accentuate the tranquil atmosphere, while the armchair and window in the background add to the homely vibe. The handbag in the lower-left corner is a subtle reminder of the relaxed and informal setting.", "co_objects": ["Coffee table", "Lamp", "Throw pillow"], "uncertain_objects": ["books", "paperback", "book", "background", "armchair", "window"], "question": "Describe this image in detail."}
{"id": "000000423481", "image": "COCO_train2014_000000423481.jpg", "value": "The image features a group of people holding tennis rackets in the air next to each other during the day. A total of eight tennis rackets can be seen held together, appearing as if they are trying to hit one flying tennis ball. The background consists of a clear blue sky.\nSeveral players are visible throughout the scene, with five people being more prominently featured than the others. This fun gathering of tennis enthusiasts gives a feeling of camaraderie and shared enjoyment of the sport.", "h_value": "The image features a group of people holding eight tennis rackets in the air, appearing as if they are trying to hit one flying tennis ball in the clear blue sky. The scene is filled with camaraderie and shared enjoyment of the sport among the tennis enthusiasts. Some players are more prominently featured than others. Water bottles or sports drinks can be seen in the background, while the tennis ball is the main focus of the players' attention.", "co_objects": ["Tennis ball", "Tennis net", "Water bottles or sports drinks"], "uncertain_objects": ["racquets", "middle", "background"], "question": "Describe this image in detail."}
{"id": "000000259243", "image": "COCO_train2014_000000259243.jpg", "value": "The image shows a man, wearing eyeglasses, standing on the deck of a large gray naval ship and holding a cell phone to his ear. He appears to be engaged in a conversation, possibly reporting or receiving information.\nSurrounding the man, there are several other people on the dock and on the ship, possibly naval personnel or visitors. Some of these individuals can be seen on the left side of the image, while others are scattered around the right side. These people reinforce the sense of activity and purpose at the waterfront.", "h_value": "The man on the deck of the naval ship is holding a clipboard to his chest as he speaks on his cell phone, surrounded by other personnel and visitors on the waterfront.", "co_objects": ["Walkie-talkie", "Binoculars", "Clipboard"], "uncertain_objects": ["dock", "sunglasses", "ship", "boat", "water", "sky", "clouds"], "question": "Describe this image in detail."}
{"id": "000000032665", "image": "COCO_train2014_000000032665.jpg", "value": "The image shows a vibrant market area with a variety of fruits and vegetables on display. Bananas are a prominent feature in the scene, with several clusters hanging above the produce stand from the ceiling. There's a wide variety of bananas in different colors and sizes, spread across the market area.\nIn addition to the bananas, apples and oranges are also on display in multiple locations within the market. The apples can be found in central and bottom-right parts of the image, while the oranges are mostly concentrated in the upper-right part and smaller amounts in the bottom-left part of the image.\nThe market appears lively and offers a diverse selection of fresh produce to choose from, creating an attractive shopping environment for customers.", "h_value": "The market is bustling with activity as vendors offer a wide selection of fresh produce. Among the offerings are delicious apples, which can be found in central and bottom-right parts of the image. In addition, a variety of other fruits and vegetables are on display, including oranges and pineapples. The canopy of bananas hanging above the produce stand adds a tropical touch to the scene, and the greenery surrounding the market creates a vibrant and inviting atmosphere.", "co_objects": ["Apples", "Oranges", "Pineapples"], "uncertain_objects": ["fruit", "canopy", "greenery", "vendors"], "question": "Describe this image in detail."}
{"id": "000000126869", "image": "COCO_train2014_000000126869.jpg", "value": "The image features a giraffe standing amidst some dead brush, facing away from the camera. The giraffe appears tall and takes up a significant portion of the frame. The background includes bushes and trees, creating a natural, outdoor setting. \nIn the scene, there is a bird flying near the giraffe, as well as several other birds scattered around the area. Their presence adds a sense of movement and life to the image, further enhancing the outdoor atmosphere.", "h_value": "The image features a giraffe standing amidst some dead brush, facing away from the camera. The giraffe appears tall and takes up a significant portion of the frame. The background includes bushes and trees, creating a natural, outdoor setting. In the scene, there is a small herd of zebras grazing in the distance, adding to the serene atmosphere. Their presence is complemented by the birds flying near the giraffe and scattered around the area, giving a sense of movement and life. The sun shining in the sky casts a warm glow on the entire scene, with a rocky outcropping or a small hill visible in the background.", "co_objects": ["Sun shining in the sky", "A small herd of zebras grazing in the distance", "A rocky outcropping or a small hill in the background"], "uncertain_objects": [], "question": "Describe this image in detail."}
{"id": "000000295236", "image": "COCO_train2014_000000295236.jpg", "value": "The image captures a bustling snowy ski area slope with numerous skiers and snowboarders enjoying their time on the mountain. The scene shows a group of people skiing and snowboarding down the slope, surrounded by the beautiful white snow. \nThere is a diverse mix of individuals, some skiing in pairs or larger groups, while others navigate the slope solo. The slope is dotted with skiers and snowboarders of various skill levels, evidenced by their differing skiing and snowboarding styles. Some pairs of skis and snowboards can be seen on the snow without any visible owners, perhaps resting nearby. \nThe image truly showcases the excitement and fun of a day spent on the mountain skiing and snowboarding.", "h_value": "The image captures the hustle and bustle of the ski area slope with numerous skiers and snowboarders enjoying their time on the mountain, aided by the ski lifts. The scene shows a diverse mix of individuals navigating the slope, surrounded by the beautiful white snow. Some pairs of skis and snowboards can be seen resting nearby, with the help of the ski patrol staff ensuring safety on the mountain. The image truly showcases the excitement and fun of a day spent on the mountain skiing and snowboarding, with the assistance of the ski lifts.", "co_objects": ["Ski lifts", "Snow-making machines", "Ski patrol staff"], "uncertain_objects": ["sky", "objects", "scene", "poles"], "question": "Describe this image in detail."}
{"id": "000000324910", "image": "COCO_train2014_000000324910.jpg", "value": "The scene features two men, both wearing ties, standing together and smiling while enjoying a social event. They are at a bar, and one of the men is holding a glass filled with a beverage, presumably beer. The other man, with a tie on the right side, is smiling at the camera.\nThere are several bottles visible on the left side of the scene, adding to the bar's atmosphere. The two young adult males seem to be having a good time and engaging in light-hearted conversation while sharing beers.", "h_value": "The two men are leaning against the bar stool, chatting and enjoying their drinks. As they smile for the camera, you can see coasters and napkins scattered around the bar. One of the men is holding a beer, while the other is wearing a tie on the right side. The scene is lively, with several bottles visible in the background. It's unclear what the metal object on the bar is, but it adds to the overall atmosphere of the bar.", "co_objects": ["Bar stool", "Coasters", "Napkins"], "uncertain_objects": ["shirt", "metal"], "question": "Describe this image in detail."}
{"id": "000000005131", "image": "COCO_train2014_000000005131.jpg", "value": "The image features a parade taking place in a major US city, most likely New York, with multiple uniformed people gathered on a street. The parade participants include police officers and pilots, all standing in an orderly line. There is a large crowd present, with several individuals wearing ties as part of their uniforms.\nVarious buildings surround the parade, emphasizing the urban setting. A traffic light can also be seen close to the center of the scene, adding to the city street atmosphere. In the crowd, a handbag is visible, carried by one of the spectators.", "h_value": "The parade in the major US city, likely New York, features a large crowd and uniformed participants including police officers and pilots standing in an orderly line. American flags wave in the background, while banners and signs promoting the event or organizations involved in the parade are displayed. In the crowd, individuals wearing suits and hats can be seen, adding to the formal atmosphere. Surrounding buildings and a traffic light emphasize the urban setting, with balloons or streamers adding a festive touch to the scene. A handbag is visible among the spectators.", "co_objects": ["American flags", "Balloons or streamers", "Banners or signs promoting the event or organizations involved in the parade"], "uncertain_objects": ["suits", "hats"], "question": "Describe this image in detail."}
{"id": "000000064492", "image": "COCO_train2014_000000064492.jpg", "value": "The image depicts a woman in a green shirt sitting at a dining table eating a meal. She is using a fork to pick at the food on her plate, which is positioned right in front of her. The table is set with a variety of items like a sandwich, a bowl, and multiple utensils such as knives and spoons. There are also several cups placed on the table.\nAlthough there are other chairs around the table, the woman appears to be dining alone, adding a sense of solitude to the scene. Other empty chairs can be seen in various positions around the dining table. Additionally, there are a few other individuals in the background, but they don't seem to be engaging with the woman or her meal.", "h_value": "The image depicts a woman in a green shirt sitting at a dining table eating a meal. She is using a fork to pick at the food on her plate, which is positioned right in front of her. The table is set with a variety of items like a sandwich, a bowl, and multiple utensils such as knives and spoons. There are also several cups placed on the table. A napkin and water glass are neatly placed beside her plate. Although there are other chairs around the table, the woman appears to be dining alone, adding a sense of solitude to the scene. Other empty chairs can be seen in various positions around the dining table. Additionally, there are a few other individuals in the background, but they don't seem to be engaging with the woman or her meal. The salt and pepper shakers are placed at the center of the table, within easy reach of the woman.", "co_objects": ["Napkin", "Water glass", "Salt and pepper shakers"], "uncertain_objects": ["hands", "eggs", "fries", "background", "chairs", "wall"], "question": "Describe this image in detail."}
{"id": "000000355801", "image": "COCO_train2014_000000355801.jpg", "value": "The image shows a large indoor facility, functioning as a parking center for numerous bicycles and motorcycles. Bicycles can be seen arranged side by side in multiple rows, adding up to at least 12 bicycles in total, both in the foreground and background of the scene. \nIn the middle of the rows of bicycles, a full-sized motorcycle catches the eye. There are also two people visible in the scene, one closer to the left side while the other one is towards the right. Both people seem to be passing through the parking area or possibly attending to their respective bicycles.", "h_value": "The image shows a large indoor facility with rows of bicycles and a full-sized motorcycle in the middle. A person on the left is seen using a bike pump on their bicycle while a person on the right is attending to their motorcycle with a helmet and locks nearby.", "co_objects": ["Helmet", "Locks", "Bike pumps"], "uncertain_objects": ["bicycles", "rows"], "question": "Describe this image in detail."}
{"id": "000000326484", "image": "COCO_train2014_000000326484.jpg", "value": "The image shows a room where a group of people is gathered, and they appear to be engaged in an event that combines a presentation with a Nintendo Wii gaming session. A woman in a red shirt stands near a podium, possibly presenting something to the audience. \nThe room has chairs placed around for the attendees, and several dining tables can also be spotted. Two women are specifically observed playing a game with Nintendo Wii controllers, probably taking a break from the presentation or demonstrating a game-related concept. A large TV screen displays the game, and it seems like they are playing bowling.\nVarious items are scattered around the room, such as books, backpacks, handbags, and a cup. A bottle is also visible, likely placed near one of the chairs or dining tables.", "h_value": "The image shows a room where a group of people is gathered for an event that combines a presentation with a Nintendo Wii gaming session. A woman in a red shirt stands near a podium, holding a microphone, possibly presenting something to the audience. The room has chairs placed around for the attendees, and several dining tables can also be spotted. Two women are specifically observed playing a game with Nintendo Wii controllers, probably taking a break from the presentation or demonstrating a game-related concept. A large TV screen displays the game, and it seems like they are playing bowling. Various items are scattered around the room, such as books, backpacks, handbags, and a cup. Snacks and refreshments are also available on the dining tables, adding to the fun and relaxed atmosphere of the event.", "co_objects": ["Microphone", "Projector", "Snacks/Refreshments"], "uncertain_objects": ["projector"], "question": "Describe this image in detail."}
{"id": "000000126021", "image": "COCO_train2014_000000126021.jpg", "value": "This scene features a group of five giraffes standing together, some of which appear to be eating leaves from a tree. Their heads and necks are prominently displayed in the close-up image. \nIn addition to the giraffes, there are numerous birds in the scene. Some birds appear to be perched on the giraffes or flying close by, while others are scattered throughout the image. The giraffes in this scene create a sense of a herd, sharing the same hillside location and enjoying their time together.", "h_value": "This scene features a group of five giraffes standing together on a hillside covered in lush grass. Some of the giraffes appear to be eating leaves from a nearby tree, while others stand tall and proud. Their heads and necks are prominently displayed in the close-up image. In addition to the giraffes, there are numerous birds perched on the trees and flying through the sky. The giraffes and birds create a sense of harmony in this beautiful natural setting.", "co_objects": ["Trees ", "Grass ", "Sky"], "uncertain_objects": ["field", "trees", "sky", "clouds"], "question": "Describe this image in detail."}
{"id": "000000515075", "image": "COCO_train2014_000000515075.jpg", "value": "The image displays a soccer game taking place on a field, with soccer players dressed in red and blue uniforms. There are at least 13 players visible in various poses, indicating that they are in between plays or transitioning to new positions on the field. A soccer ball can be seen near the bottom right quadrant of the image, with one player likely about to kick it during the game. The players are spread across the field, with some standing closer to the edges, while others are near the center of the action.", "h_value": "The image displays a soccer game taking place on a field, with soccer players dressed in red and blue uniforms. There are at least 13 players visible in various poses, indicating that they are in between plays or transitioning to new positions on the field. A soccer ball can be seen near the bottom right quadrant of the image, with one player likely about to kick it during the game. The players are spread across the field, with some standing closer to the edges, while others are near the center of the action. The game is officiated by a referee, and there are goal posts on either end of the field. The team identities and exact location of the spectators is uncertain.", "co_objects": ["Referee", "Spectators", "Goal posts"], "uncertain_objects": ["team", "spectators", "center"], "question": "Describe this image in detail."}
{"id": "000000427493", "image": "COCO_train2014_000000427493.jpg", "value": "The image showcases a modern, contemporary kitchen featuring stainless steel appliances, including a refrigerator, oven, and microwave. The kitchen is furnished with white cabinets and wooden counters, giving it an elegant and clean appearance. There is a dining table surrounded by chairs in the room. On this table, a decorative vase is placed. \nIn the kitchen, there is also a sink with a potted plant beside it, adding a touch of greenery to the space. A variety of cups and bowls are placed around the room, indicating that the kitchen is well-stocked and functional. Additionally, there are a couple of black stools located near the wooden counter, offering a casual seating option in the kitchen area.", "h_value": "The image showcases a modern, contemporary kitchen featuring stainless steel appliances, including a refrigerator, oven, and microwave. The kitchen is furnished with white cabinets and wooden counters, giving it an elegant and clean appearance. There is a dining table surrounded by chairs in the room. On this table, a decorative vase is placed. In the kitchen, there is also a sink with a potted plant beside it, adding a touch of greenery to the space. A variety of cups and bowls are placed around the room, indicating that the kitchen is well-stocked and functional. Additionally, there are a couple of black stools located near the wooden counter, offering a casual seating option in the kitchen area. The cutting board is neatly placed on the counter, ready for use, and the coffee maker is conveniently located next to the sink.", "co_objects": ["Dish towels", "Cutting board", "Coffee maker"], "uncertain_objects": ["kitchen", "refrigerator", "bar", "sink", "room"], "question": "Describe this image in detail."}
{"id": "000000446471", "image": "COCO_train2014_000000446471.jpg", "value": "The image displays an assortment of teddy bears in various shades of pink. These adorable plush toys can be seen sitting together on multiple shelves and a row of them laying on the floor in a room. In total, there are hundreds of teddy bears in the room, creating an eye-catching collection.\nIn addition to the teddy bears, there are a few cups strategically placed around the room. One cup can be seen on the bottom left corner of the image, while another rests higher on the right side. Another cup can be found positioned further back in the top-right area of the room.\nThis delightful scene showcases a large group of teddy bears, creating a playful and inviting atmosphere.", "h_value": "The image displays an assortment of teddy bears in various shades of pink alongside decorative pillows. These adorable plush toys can be seen sitting together on multiple shelves and a row of them laying on the floor in a room. In total, there are hundreds of teddy bears in the room, creating an eye-catching collection.\nIn addition to the teddy bears and pillows, there are a few cups strategically placed around the room. One cup can be seen on the bottom left corner of the image, while another rests higher on the right side. Another cup can be found positioned further back in the top-right area of the room.\nThis delightful scene showcases a large group of teddy bears and decorative pillows, creating a playful and inviting atmosphere.", "co_objects": ["Stuffed animals (besides teddy bears)", "Children's books", "Decorative pillows"], "uncertain_objects": ["teddy"], "question": "Describe this image in detail."}
{"id": "000000074183", "image": "COCO_train2014_000000074183.jpg", "value": "The image depicts a vintage photograph of a young baseball team. The players are sitting close together on benches, with some young men in the foreground and others in the background. There are multiple baseball gloves scattered throughout the scene, indicating their involvement in the sport. \nThe team members appear in various positions, such as sitting on one of the three benches visible in the image, with two of them placed horizontally, while the third bench is positioned in the background near the edge of the scene. Overall, it captures a group of young baseball players spending time together, likely bonding as a team or taking a break in between the games.", "h_value": "The vintage photograph depicts a young baseball team, with scattered baseball gloves throughout the scene. The team members, dressed in team jerseys and baseball helmets, are sitting close together on benches, including one placed in the background near the edge. One young man is holding a baseball bat, ready for the next game. Overall, it captures a group of young baseball players spending time together, likely bonding as a team or taking a break in between the games.", "co_objects": ["Baseball bats", "Team jerseys", "Baseball helmets"], "uncertain_objects": [], "question": "Describe this image in detail."}
{"id": "000000013302", "image": "COCO_train2014_000000013302.jpg", "value": "The image depicts a girl wearing a swimsuit running on the beach, flying a kite joyfully. The kite can be seen in the air above her, giving a sense of motion to the scene. The beach includes a residential area or hotels nearby, as various chairs and benches are scattered around the sands, evoking a comfortable and relaxing atmosphere. Some chairs are located closer to the water, while others are set up further back in the scene, possibly to provide more privacy for beachgoers. The girl's activity and the presence of chairs and benches convey the perfect day for enjoying outdoor activities by the ocean.", "h_value": "The image depicts a girl wearing a swimsuit running on the beach, flying a kite joyfully. The kite can be seen in the air above her, giving a sense of motion to the scene. The beach includes a residential area or hotels nearby, as various chairs and benches are scattered around the sands, evoking a comfortable and relaxing atmosphere. Some chairs are located closer to the water, while others are set up further back in the scene, possibly to provide more privacy for beachgoers. The girl's activity and the presence of beach umbrella convey the perfect day for enjoying outdoor activities by the ocean.", "co_objects": ["Beach towel", "Sunscreen", "Beach umbrella"], "uncertain_objects": ["hand", "ocean", "palm", "sign", "Breakers", "Resort", "patio", "frame."], "question": "Describe this image in detail."}
{"id": "000000054696", "image": "COCO_train2014_000000054696.jpg", "value": "The image is of a vintage scene with a classic airplane on a grass field. The airplane has a propeller and is positioned in the middle of the scene. Many people are gathered around the airplane, some of them likely boarding the plane or preparing for departure.\nIn total, there are 13 people visible in the photograph, with some standing closer to the airplane on the right, and others scattered around the left side. The grass field around the airplane further enhances the nostalgic ambiance of the scene. Overall, the image tells the story of a time when air travel was a relatively new mode of transportation, with people attending to an event in this field.", "h_value": "The vintage airplane in the middle of the grass field is surrounded by a crowd of 13 people, some of whom are loading up classic luggage onto the plane. The nostalgic ambiance of the scene is enhanced by the presence of vintage cars parked nearby, adding to the sense of a bygone era.", "co_objects": ["Vintage cars ", "Picnic baskets ", "Old-fashioned luggage"], "uncertain_objects": ["plane", "runway", "people"], "question": "Describe this image in detail."}
{"id": "000000411603", "image": "COCO_train2014_000000411603.jpg", "value": "The scene features a brightly colored bus parked in the middle of a parking lot. People are gathered around the area, with some of them sitting on benches that are nearby. A total of three benches are distributed around the parking area, with one close to the left side of the bus and two more located further back.\nA few dining tables are also present in the scene, likely for people to enjoy their food from the bus, which appears to function as a food truck. Additionally, there are various personal items such as cups and handbags around the tables and benches.\nIn the background, a car is parked slightly behind the bus, and a truck is spotted near the center of the parking lot. A horse is also visible in this scene, standing behind the dining tables on the left side.", "h_value": "The food truck menu board displays a variety of options for customers to choose from while umbrellas provide shade at the nearby tables. Among the personal items scattered around the benches, a lone cup stands out. The brightly colored bus acts as a focal point in the parking lot, where people gather to enjoy their meals. In the background, a car and truck are parked, and a horse stands behind the dining tables. Trash cans are conveniently located for disposal. The scene is full of vibrant pink colors, accentuated by the bold lettering on the menu board and brick walls.", "co_objects": ["Food truck menu board", "Trash cans for disposal", "Umbrellas for shade at the tables"], "uncertain_objects": ["woman", "pink", "colors", "sign", "lettering", "cup", "brick"], "question": "Describe this image in detail."}
{"id": "000000502324", "image": "COCO_train2014_000000502324.jpg", "value": "In the image, two mounted police officers are riding horses on patrol through a town square. The officers are surrounded by a mix of individuals, busy walking through the city. The urban setting features tall buildings in the background.\nThere are several vehicles in the scene, including parked cars and a truck. Additionally, a clock is visible on a building or post, adding to the city ambiance. In total, there are five horses in the scene. Some are interacting with their riders, while others are positioned near pedestrians.", "h_value": "In the image, two mounted police officers are riding horses on patrol through a town square. The officers are surrounded by a mix of individuals, busy walking through the city. The urban setting features tall buildings in the background.\nThere is a parked truck in the scene, adding to the bustling city atmosphere. Additionally, a clock is visible on a building or post, helping pedestrians keep track of time. In total, there are five horses in the scene. Some are interacting with their riders, while others are positioned near pedestrians.\nThere is some uncertainty about the objects such as the tower, hats, and uniforms seen in the scene.", "co_objects": ["Parked cars", "Truck", "Clock on a building or post"], "uncertain_objects": ["tower", "hats", "uniforms"], "question": "Describe this image in detail."}
{"id": "000000002498", "image": "COCO_train2014_000000002498.jpg", "value": "A group of people are outdoors in a muddy field, playing with a Frisbee despite the rain. There are at least seven individuals spread around the field, with four of them close together and engaged in an action-packed moment as they jump to catch the flying disc. A couple more players can be seen further away from the main group, while others are either standing or crouching, possibly preparing to join the game or already part of it. \nTwo backpacks are noticeably placed on the ground, suggesting that the players' belongings are nearby. The entire scene is a fun display of people enjoying an outdoor activity even in challenging weather conditions.", "h_value": "A group of people are outdoors in a muddy field, playing with a Frisbee despite the rain. There are at least seven individuals spread around the field, with four of them close together and engaged in an action-packed moment as they jump to catch the flying disc. A couple more players can be seen further away from the main group, while others are either standing or crouching, possibly preparing to join the game or already part of it. Two backpacks and water bottles are noticeably placed on the ground, suggesting that the players' belongings and hydration are nearby. The entire scene is a fun display of people enjoying an outdoor activity even in challenging weather conditions.", "co_objects": ["Umbrellas", "Towels", "Water bottles"], "uncertain_objects": ["sun", "line", "colors", "lake"], "question": "Describe this image in detail."}
{"id": "000000099724", "image": "COCO_train2014_000000099724.jpg", "value": "The image showcases two young men wearing suits and ties, standing close to each other as they pose for a picture. The men can be seen leaning their heads together, with one man resting his head on the other's shoulder in a friendly, informal manner. The ties they are wearing are noticeable as a symbol of the professional attire. \nIn the background, there are several other people present in the scene, but the main focus remains on the two men in suits.", "h_value": "The image showcases two young men wearing suits and ties, standing close to each other as they pose for a picture. The men can be seen leaning their heads together, with one man resting his head on the other's shoulder in a friendly, informal manner. The camera captures their genuine camaraderie. The ties they are wearing are noticeable as a symbol of the professional attire. In the backdrop, there are several other people present in the scene, but the main focus remains on the two men in suits.", "co_objects": ["Camera", "Backdrop or scenery", "Lighting equipment"], "uncertain_objects": ["man", "ground"], "question": "Describe this image in detail."}
{"id": "000000128093", "image": "COCO_train2014_000000128093.jpg", "value": "The image features a young boy in a purple shirt sitting at an iron outdoor patio table, participating in a picnic-like event. He is eating a hot dog, and he appears to be a fan of the Boston Red Sox by the gear he is wearing. The table is surrounded by several benches where many other people are seated or standing nearby.\nIn the background, there are multiple other people, some of whom are involved in their own activities. A handbag can be spotted near the center-left of the scene. On the table, there is a bottle positioned towards the right side. The scene appears to be a lively outdoor gathering with people of various ages enjoying themselves.", "h_value": "The image features a young boy in a purple shirt sitting at an iron outdoor patio table, participating in a picnic-like event. He is eating a hot dog with ketchup and mustard bottles nearby, and he appears to be a fan of the Boston Red Sox by the gear he is wearing. The table is surrounded by several benches where many other people are seated or standing nearby. In the background, there are multiple other people, some of whom are involved in their own activities. A handbag can be spotted near the center-left of the scene. On the table, there are paper plates and napkins positioned towards the left side. The scene appears to be a lively outdoor gathering with people of various ages enjoying themselves, with trees in the background.", "co_objects": ["Ketchup and mustard bottles", "Baseball glove and ball", "Paper plates and napkins"], "uncertain_objects": ["trees"], "question": "Describe this image in detail."}
{"id": "000000206405", "image": "COCO_train2014_000000206405.jpg", "value": "The image features a neat workspace with a variety of assorted books arranged in stacks. Some of the books are focused on architecture, and there is one large pile of books placed next to the electronic keyboard. The stacks of books are sitting in front of the keyboard, and some are underneath a computer screen. \nA laptop is positioned above the keyboard, possibly being held up by some of the stacked books, creating a comfortable working environment. The books vary in size and height, showcasing different subjects and interests.", "h_value": "The desk lamp casts a warm glow over the workspace, illuminating the assorted books stacked neatly in front of the electronic keyboard. Among the books on architecture, a large pile sits next to the keyboard, creating a comfortable working environment. A coffee mug and pen/pencil holder are also within reach on the desk. The laptop is positioned above the keyboard, possibly supported by some of the stacked books, while various documents and papers are visible on the surface.", "co_objects": ["Desk lamp", "Coffee mug", "Pen/pencil holder"], "uncertain_objects": ["laptop", "book", "document", "visible", "surface"], "question": "Describe this image in detail."}
{"id": "000000353288", "image": "COCO_train2014_000000353288.jpg", "value": "The image captures a city street scene with a large clock attached to a building. There are several people on the sidewalk, including two women walking in different areas. One woman is walking down the street with a suitcase, and another woman is walking while carrying a handbag. Additionally, three more people can be seen further down the sidewalk.\nA bicycle and a car are parked alongside the street, adding to the bustling city atmosphere. The time shown on the clock is four o'clock, which could indicate the time when this city sidewalk is active with people passing by.", "h_value": "The image captures a bustling city street scene with a large clock attached to a building. A newspaper stand can be seen on the sidewalk, surrounded by several people. Two women are walking in different areas, one carrying a handbag and the other with a suitcase. Additionally, three more people can be seen further down the sidewalk. A bicycle and a car are parked alongside the street, adding to the busy city atmosphere. The time shown on the clock is four o'clock, which could indicate the time when this city sidewalk is active with people passing by.", "co_objects": ["Traffic light", "Trash can", "Newspaper stand"], "uncertain_objects": ["scarf", "bricks", "streets"], "question": "Describe this image in detail."}
{"id": "000000181155", "image": "COCO_train2014_000000181155.jpg", "value": "The image shows a stylish and bright living room with light-colored furniture. A large mirror is mounted on the wall above a couch, which is situated on the left side of the room. In the living room, there are two potted plants, one placed closer to the center of the room and the other on the right side.\nThe space also includes a dining room area with a table positioned near the right side of the room. Surrounding the dining table, there are several chairs, ensuring ample seating for guests. Apart from the dining area, there are additional chairs spread across the room, with one chair on the left side and another on the far right side. Overall, the living room and dining room offer a harmonious and welcoming atmosphere.", "h_value": "The image shows a stylish and bright living room with light-colored furniture. A large mirror is mounted on the wall above a couch, which is situated on the left side of the room. In the living room, there are two potted plants, one placed closer to the center of the room and the other on the right side. A floor lamp adds a warm and cozy ambiance to the space.\n\nThe space also includes a dining room area with a table positioned near the right side of the room. Surrounding the dining table, there are several chairs, ensuring ample seating for guests. Apart from the dining area, there are additional chairs spread across the room, with one chair on the left side and another on the far right side. Overall, the living room and dining room offer a harmonious and welcoming atmosphere. The decorative throw pillows on the couch add a pop of color to the room.", "co_objects": ["Decorative throw pillows", "Coffee table", "Floor lamp"], "uncertain_objects": ["chair", "coffee", "dining"], "question": "Describe this image in detail."}
{"id": "000000369418", "image": "COCO_train2014_000000369418.jpg", "value": "The image features a lively gathering of people sitting around a dining table, enjoying a meal together. They are predominantly eating pizza, which can be seen in various slices and sizes scattered across the table. In addition, several cups and bottles are placed along the table, enhancing the atmosphere of a friendly social event.\nThere are at least ten people present in the scene, with some sitting closer to the front and others further in the background. A few of the individuals are eating, while one man in particular is serving himself a slice of pizza. The chairs around the table seem comfortable, encouraging the guests to linger and engage in conversation during the meal.", "h_value": "The image features a lively gathering of people sitting around a dining table, enjoying a meal together. They are predominantly eating pizza, which can be seen in various slices and sizes scattered across the table. In addition, several wine glasses are placed along the table, enhancing the atmosphere of a friendly social event. \n\nThere are at least ten people present in the scene, with some sitting closer to the front and others further in the background. A few of the individuals are eating, while one man in particular is serving himself a slice of pizza. The chairs around the table seem comfortable, encouraging the guests to linger and engage in conversation during the meal. The napkins and plates are neatly arranged around the table, adding to the overall sense of organization and preparation.", "co_objects": ["Napkins", "Plates", "Wine glasses"], "uncertain_objects": ["slices", "drinks", "bowls", "clothes", "food"], "question": "Describe this image in detail."}
{"id": "000000044946", "image": "COCO_train2014_000000044946.jpg", "value": "The image features a group of people gathered around a dining table in a restaurant, enjoying a meal together. There are at least six people visible around the table, with some adults sitting and others standing. \nOn the table, there is a pizza being cut by a waiter or one of the diners. There are multiple cups, bottles, and knives on the table, indicating that everyone is sharing drinks and eating the pizza. Additionally, there are a few chairs placed around the table, creating a social and inviting atmosphere for the diners. Another dining table can be seen in the background, and a person sits at the very back of the scene.", "h_value": "The image features a group of people gathered around a dining table in a restaurant, enjoying a meal together. There are at least six people visible around the table, with some adults sitting and others standing. On the table, there are napkins neatly placed beside the plates and menu cards. A pizza is being cut by a waiter or one of the diners, with slices already on some of the plates. There are multiple cups, bottles, and knives on the table, indicating that everyone is sharing drinks and eating the food. Additionally, there are a few chairs placed around the table, creating a social and inviting atmosphere for the diners. Another dining table can be seen in the background, and a person sits at the very back of the scene.", "co_objects": ["Napkins", "Plates", "Menu cards"], "uncertain_objects": ["pizza", "slices", "platter", "plates", "food"], "question": "Describe this image in detail."}
{"id": "000000289740", "image": "COCO_train2014_000000289740.jpg", "value": "The image shows a man in the process of loading luggage into the back of an SUV, which appears to be nearly full. He is kneeling on the asphalt, trying to fit multiple suitcases into the storage area of the vehicle. Another person, only partially visible (showing just an arm and a side), is standing nearby, most likely assisting in the process. \nThere are several suitcases around the vehicle, some of which are already inside, while others are still waiting to be placed in the back of the SUV. Another man and a woman are visible in the scene, but their presence seems to be unrelated to the luggage loading task. Close to the vehicle, there is also a handbag, likely belonging to one of the individuals present.", "h_value": "The image shows a man using packing tape to secure a duffle bag and folding chairs to the nearly full back of an SUV. He is kneeling on the asphalt, with a pile of backpacks and suitcases around him, trying to fit everything into the storage area of the vehicle. Another person is standing nearby, most likely assisting in the process, while a man and a woman are visible in the scene, seemingly unrelated to the luggage loading task. Close to the vehicle, there is also a handbag, likely belonging to one of the individuals present.", "co_objects": ["Packing tape", "Duffle bag", "Folding chairs"], "uncertain_objects": ["man", "back", "car", "pile", "backpacks"], "question": "Describe this image in detail."}
{"id": "000000199958", "image": "COCO_train2014_000000199958.jpg", "value": "The image showcases a variety of food items displayed on a wooden dining table, ready for preparing a dish. The main ingredients include carrots and leeks, which are laid out on a bamboo cutting board. Additionally, there are oranges placed on the table and a couple of cups nearby.\nTwo bottles are also present, one towards the left and slightly back from the cutting board and the other further left towards the edge of the table. A book is opened near the top of the table, possibly containing a recipe or instructions for the dish being prepared.", "h_value": "The image showcases a variety of food items displayed on a wooden dining table, ready for preparing a dish. The main ingredients include carrots and leeks, which are laid out on a bamboo cutting board with a knife nearby. Additionally, there are oranges placed on the table and a couple of cups nearby.\nTwo bottles are also present, one towards the left and slightly back from the cutting board and the other further left towards the edge of the table. A book is opened near the top of the table containing a recipe or instructions for the dish being prepared.", "co_objects": ["Knife", "Pot or pan", "Chopping board"], "uncertain_objects": ["leeks", "bottle", "spices", "table"], "question": "Describe this image in detail."}
{"id": "000000334868", "image": "COCO_train2014_000000334868.jpg", "value": "The image features an airport tarmac with various airplanes and vehicles scattered around. A large white jet with black letters is parked prominently in the middle of the scene, accompanied by other smaller airplanes dispersed throughout the area.\nSeveral trucks can be seen nearby, likely involved in the process of loading or unloading cargo. One of them is holding a billboard. Cars are also present in the scene, with one parked closer to the foreground and two others visible near the white jet.\nA person is working among the vehicles, possibly attending to their tasks, and a suitcase can be spotted near the person, indicating that luggage or food supplies are being loaded onto the airplane.", "h_value": "The fuel tanker is parked near the large white jet on the busy airport tarmac, as workers attend to their tasks and luggage is loaded onto the plane. Other smaller airplanes and vehicles can be seen scattered throughout the area, including stair trucks for boarding passengers.", "co_objects": ["Luggage carts", "Fuel tankers", "Stair trucks for boarding passengers onto the planes"], "uncertain_objects": ["runway", "planes", "truck", "buildings", "façade", "visible"], "question": "Describe this image in detail."}
{"id": "000000121943", "image": "COCO_train2014_000000121943.jpg", "value": "The image displays a group of female soccer players in action on a field. Two women are particularly focused on chasing after a soccer ball. As they run towards it, their teammates and opponents scatter across the field, positioning themselves for the ongoing play. \nIn addition to the players, there are a couple of benches situated on the sidelines, likely for resting or waiting team members. One bench is placed on the left side of the field while the other is situated towards the right side.", "h_value": "The image displays a group of female soccer players in action on a field. Two women are particularly focused on chasing after a soccer ball. As they run towards it, their teammates and opponents scatter across the field, positioning themselves for the ongoing play. The goalposts stand tall in the background, while one of the players blows the referee whistle to signal the start of the game. In addition to the players, there are a couple of benches situated on the sidelines, likely for resting or waiting team members. One bench is placed on the left side of the field while the other is situated towards the right side. The players take a quick break to sip water from their bottles before continuing the intense game.", "co_objects": ["Referee whistle", "Water bottles", "Goalposts"], "uncertain_objects": ["uniforms", "game", "bleachers", "sun"], "question": "Describe this image in detail."}
{"id": "000000288032", "image": "COCO_train2014_000000288032.jpg", "value": "The scene depicts a man lying on a wooden bench in a city park. He is using a green umbrella as a sunshade while taking a nap. This bench is one of the three benches in the area, with another bench being located right behind the man and the third one positioned further to the right of the scene.\nThere are also several other people scattered throughout the park. At least four individuals can be seen standing near the resting man, perhaps having conversations or enjoying the park themselves. Another person is walking a bit further behind the man, more towards the center of the park.", "h_value": "The man on the wooden bench in the city park is peacefully napping under the shade of his green umbrella, with a water bottle resting beside him. The park is bustling with activity, with several individuals chatting and enjoying the sunny day around him. In the distance, a person can be seen walking towards the center of the park, while a book or magazine lies forgotten on the bench behind him.", "co_objects": ["Water bottle", "Book or magazine", "Sunglasses"], "uncertain_objects": ["person", "sidewalk", "eyes", "bar", "metal", "view"], "question": "Describe this image in detail."}
{"id": "000000024794", "image": "COCO_train2014_000000024794.jpg", "value": "In this scene, three people are standing together, with a man and a woman in the foreground focused on their cell phones. Another person stands in the background near the left side of the image. The woman in the tight dress is holding her phone and appears to be in the middle of drinking from a cup while simultaneously looking at her phone. The man next to her is also holding his phone, seemingly engaged with its content. A bottle can be seen in the background, likely part of the beverage setup for the gathering.", "h_value": "In this scene, three people are gathered around a table, with a man and a woman in the foreground focused on their cell phones. Another person stands in the background near the left side of the image. The woman in the tight dress is holding her phone and appears to be in the middle of drinking from a cup while simultaneously looking at her phone. The man next to her is also holding his phone, seemingly engaged with its content. A bottle of wine can be seen in the background, likely part of the beverage setup for the gathering.", "co_objects": ["Table or surface to place their drinks on", "Chairs or stools for the people to sit on", "Snacks or appetizers for the gathering"], "uncertain_objects": ["bottle", "rest", "setting", "tree"], "question": "Describe this image in detail."}
